{
  "generatedAt": "2025-10-07T20:42:48.290705",
  "generatedAtUK": "2025-10-07T20:42:48.290890+01:00",
  "displayTimestamp": "Tuesday, October 07, 2025 at 20:42 BST",
  "totalArticles": 48,
  "source": "NewsAPI Live Feed (Enhanced)",
  "quality_threshold": 7.0,
  "features": [
    "Full text extraction",
    "Time-based filtering",
    "Smart image selection",
    "AI importance scoring",
    "Unlimited emoji selection",
    "Claude AI rewriting (40-50 words)"
  ],
  "articles": [
    {
      "title": "Turning AI from theory to ROI: The rise of practical enterprise adoption models",
      "description": "By turning artificial intelligence from theory into measurable business value, pragmatic enterprise AI adoption focuses on structured, results-driven integration rather than chasing flashy projects. Using a sensible enterprise AI adoption approach converts AI…",
      "url": "https://siliconangle.com/2025/10/07/enterprise-ai-adoption-driving-real-business-value-cohere-aifactoriesdatacenters/",
      "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2025/09/Screenshot-35.png",
      "publishedAt": "2025-10-07T19:22:05Z",
      "source": {
        "id": null,
        "name": "SiliconANGLE News"
      },
      "author": "Brian Njuguna",
      "content": "By turning artificial intelligence from theory into measurable business value, pragmatic enterprise AI adoption focuses on structured, results-driven integration rather than chasing flashy projects. … [+4333 chars]",
      "full_text": "UPDATED 15:22 EDT / OCTOBER 07 2025 by Brian Njuguna By turning artificial intelligence from theory into measurable business value, pragmatic enterprise AI adoption focuses on structured, results-driven integration rather than chasing flashy projects. Using a sensible enterprise AI adoption approach converts AI from buzzword to strategic driver of measurable business outcomes — and Cohere Inc. is leading the way. This entails going the extra mile to deliver real return on investment, according to Autumn Moulder (pictured), vice president of engineering at Cohere. Cohere’s Autumn Moulder talks about enterprise AI adoption. “We’ve really evolved and said, ‘What does an enterprise need to adopt this fundamentally transformational technology?’” Moulder asked. “We’ve evolved from, we build the foundation model to let’s bring in some applications, the North products that we’ve recently developed, to make it easier to adopt AI within the enterprise, to partnering with these companies to say, ‘Hey, we can help you build a custom model. We can help you build a custom agent.’” Moulder spoke with theCUBE’s John Furrier at theCUBE + NYSE Wired: AI Factories – Data Centers of the Future event, during an exclusive broadcast on theCUBE, SiliconANGLE Media’s livestreaming studio. They discussed the critical role of pragmatic enterprise AI adoption, noting innovations developed by Cohere. Partnerships are key to enterprise AI adoption. Scaling AI isn’t just about software — it requires aligning technology, talent, data, processes and strategy. With deep expertise in machine learning, NLP, data engineering and AI governance, Cohere is already leading the way, according to Moulder. “We very much have focused on that enterprise segment,” she explained. “We see this as a place where we can drive a lot of value and really help people navigate this transition. There’s a recent MIT study that came out about how enterprise partnerships, where you partner with an external entity versus rolling it yourself, [has] like twice the success rate when you’re looking to adopt AI. We’ve really taken that to heart coming from our foundations of building models.” Pragmatic enterprise AI adoption goes beyond installing software — it demands the right blend of capabilities to tackle real business challenges. Large language models offer adaptability and conversational intelligence, while specialized models deliver precision and domain expertise. Together, they enable versatile, operationally effective AI solutions — something Cohere is uniquely positioned to deliver, Moulder pointed out. “We focus very much on efficiency, which ties it to this idea of large language models, small language models, what’s the right size model and making sure that we can deliver the point solution whether it’s a small language model for a highly efficient work flow,” she said. “We bring both of those to the table. We see this as an efficiency story and we also see it as a privacy story making sure you can hit both of those pieces.” Here’s the complete video interview, part of SiliconANGLE’s and theCUBE’s coverage of theCUBE + NYSE Wired: AI Factories – Data Centers of the Future event: Support our mission to keep content open and free by engaging with theCUBE community. Join theCUBE’s Alumni Trust Network, where technology leaders connect, share intelligence and create opportunities. Founded by tech visionaries John Furrier and Dave Vellante, SiliconANGLE Media has built a dynamic ecosystem of industry-leading digital media brands that reach 15+ million elite tech professionals. Our new proprietary theCUBE AI Video Cloud is breaking ground in audience interaction, leveraging theCUBEai.com neural network to help technology companies make data-driven decisions and stay at the forefront of industry conversations. Oracle NetSuite overhauls user experience, introduces AI-driven updates Qualtrics expands into healthcare and analytics with planned $6.75B Press Ganey Forsta purchase Opkey expands Argano partnership to accelerate Oracle automation with agentic AI Dataiku's new Agent Hub gives businesses full control over agentic AI automation Exclusive: FormAssembly launches AI assistant to streamline data collection ClickHouse extends Series C round to fuel real-time analytics and AI growth Oracle NetSuite overhauls user experience, introduces AI-driven updates AI - BY PAUL GILLIN . 3 HOURS AGO Qualtrics expands into healthcare and analytics with planned $6.75B Press Ganey Forsta purchase AI - BY PAUL GILLIN . 4 HOURS AGO Opkey expands Argano partnership to accelerate Oracle automation with agentic AI AI - BY DUNCAN RILEY . 6 HOURS AGO Dataiku's new Agent Hub gives businesses full control over agentic AI automation AI - BY MIKE WHEATLEY . 6 HOURS AGO Exclusive: FormAssembly launches AI assistant to streamline data collection AI - BY PAUL GILLIN . 6 HOURS AGO ClickHouse extends Series C round to fuel real-time analytics and AI growth BIG DATA - BY DUNCAN RILEY . 6 HOURS AGO",
      "full_text_length": 4999,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Cohere Inc. is spearheading practical enterprise AI adoption by focusing on measurable business outcomes rather than theoretical applications. The company's VP of Engineering, Autumn Moulder, emphasizes partnerships and efficiency, noting that external collaborations show double the success rate compared to in-house AI implementations.",
      "word_count": 43
    },
    {
      "title": "Jonah Hill Shows Major Weight Loss Transformation on Set of New Movie",
      "description": "Jonah Hill is committing to his next movie role in a major way. The Wolf of Wall Street star looked unrecognizable in an eccentric costume highlighting his significant weight loss as he stepped...",
      "url": "https://www.eonline.com/news/1423505/jonah-hills-weight-loss-transformation-on-cut-off-set",
      "urlToImage": "https://akns-images.eonline.com/eol_images/Entire_Site/20251007/1a02bafa-6077-4703-a0b3-f0759201ae46_1759864393.jpg?fit=around%7C1080:1080&output-quality=90&crop=1080:1080;center,top",
      "publishedAt": "2025-10-07T19:21:48Z",
      "source": {
        "id": null,
        "name": "Eonline.com"
      },
      "author": "",
      "content": "Lizzo simply wanted to feel better from head to toe.  Once I started working out for mental health, to have balanced mental health or endorphins, so that I don't look at myself in the mirror and feel… [+896 chars]",
      "full_text": "Jonah Hill is committing to his next movie role in a major way. The Wolf of Wall Street star looked unrecognizable in an eccentric costume highlighting his significant weight loss as he stepped out on set of his new comedy Cut Off in Los Angeles Oct. 6. While exiting his trailer, Jonah, 41, donned a skin-tight leopard print turtleneck, blue jeans with black fringe and tan boots. He completed the quirky ensemble by sporting shaggy blonde hair and a pair of cat-eye glasses. The film, which costars Kristen Wiig, follows two siblings whose wealthy parents cut them off financially, according to The Hollywood Reporter. And Jonah is doing more than just take on a major role in front of the camera, he’s also directing and producing the project from a script he cowrote, with a theatrical release set for July 2026. It’s not the first time Jonah has transformed his body for a role, either. He previously spoke about gaining weight for the crime comedy War Dogs, later calling one of his celebrity pals for tips on how to tone up after filming. “I called Channing Tatum and said, ‘Hey, if I eat less and go to a trainer, will I get in good shape?’” he said during an appearance on The Tonight Show in 2016. “He’s like, ‘Yeah, you dumb motherf--ker, of course you will. It’s the simplest thing in the entire world.’” But the Oscar nominee has also been candid about struggling with his appearance. In 2021, he penned an open letter detailing his struggles with his weight after photos of him shirtless at the beach were published online. “I don't think I ever took my shirt off in a pool until I was in my mid 30s even in front of family and friends,” he wrote in a post on his Instagram page, which he deleted in August 2022. “Probably would have happened sooner if my childhood insecurities weren't exacerbated by years of public mockery about my body by press and interviewers.” But as Jonah went on to note, his self-worth had come a long way since then. “The idea that the media tries to play me by stalking me while surfing and printing photos like this and it can't phase me anymore is dope,” he continued. “I'm 37 and finally love and accept myself.” Keep reading to see more stars who have undergone major weight loss transformations… Trevor Larcom The Fresh Off the Boat alum used to weigh 300 pounds and lost 130, showcasing his journey on TikTok. Tammy Slaton Tammy Slaton may be a star of TLC’s 1,000-Lb. Sisters, but she didn’t want to be beholden to that title forever. “I’m down 500 pounds now, around 500,” the 38-year-old said in a confessional on an April 2025 episode of her show. “When I was at my heaviest, I was 700-plus pounds. Right now, I’m weighing in at 238.” She underwent bariatric surgery in 2022, a choice her physician has praised as the right one for her. “Tammy has consistently demonstrated her dedication to making sustainable lifestyle changes to maximize the benefits of her surgery,” Dr. Eric Smith told People in October 2024. “I've emphasized the importance of making small, daily adjustments to ensure not only her continued progress but also her long-term success. She's truly committed to her health journey.” Jelly Roll It seems as if every time Jelly Roll hits a red carpet, he’s down a sizable slice of weight. “I started at 540 pounds and I was 357 pounds this morning,” the singer born Jason DeFord told Pat McAfee in April 2025 during the ESPN host's Big Night Aht live show. “I’m gonna lose another 100 pounds and go skydiving with my wife in Sweden, baby!\" The 6-foot-1 artist admittedly needed to overhaul his relationship with food to get where he wanted to go. \"I've always said that I believe obesity is directly connected to mental health,\" he explained on an October 2024 episode of On Purpose With Jay Shetty. \"I know how easy it is for people to go, 'Just quit eatin' so much, just work out, it's so easy!' I wish I looked at food that way.” Weight was still “the mountain” in front of him, Jelly Roll noted, but his lifestyle changes were working. \"I'm learning, I'm being very diligent with it,” he said. “I'm taking it serious, I'm drinking a bunch of water, I'm cold plunging, I'm eating right, I'm doing good.\" Al Roker Al Roker wasn’t kidding around with the title of his cookbook Recipes to Live By. Because having lost a hard-fought 100 pounds, the longtime TODAY weatherman literally walks the walk (aiming for at least 10,000 steps a day), watching what he eats and fitting in some sort of exercise on a daily basis. “My mantra is ‘something is better than nothing,’” he told People in a June 2025 interview. “Maybe you’ll be running marathons or entering weight-lifting contests, but I think most people just want a level of fitness that improves their quality of life.” Roker underwent gastric bypass surgery in 2002 to get his fitness journey underway, but, he acknowledged, “There’s no magic bullet.” Surgery is “not the end,” he advised. “You’re still going to have to put in the work.” Jason Kelce While previously known fo",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Actor Jonah Hill unveiled a dramatic weight loss transformation while filming his new comedy \"Cut Off\" in Los Angeles. Sporting a leopard-print turtleneck and blonde hair, the unrecognizable star is not only acting but also directing and producing the film, which follows siblings cut off from family wealth.",
      "word_count": 48
    },
    {
      "title": "Mixed opening day for Rob Dickson and Seán Waddilove at 49er World Championships",
      "description": "Dublin pair win opener before setbacks in second and third races",
      "url": "https://www.irishtimes.com/sport/2025/10/07/mixed-opening-day-for-rob-dickson-and-sean-waddilove-at-49er-world-championships/",
      "urlToImage": "https://www.irishtimes.com/resizer/v2/75XD7OXNT6M5PTIZ4NF6FMV4E4.jpg?smart=true&auth=e7f2050c07fff7a54bd4f9ae4668bfa25eac017a93b972aded76650c89c4cdfe&width=1200&height=630",
      "publishedAt": "2025-10-07T19:19:19Z",
      "source": {
        "id": "the-irish-times",
        "name": "The Irish Times"
      },
      "author": "David Branigan",
      "content": "In a reprise of their Olympic debut at Tokyo 2020, Irelands Rob Dickson and Seán Waddilove stole a solid race win to open their World Championship series in Sardinia on Tuesday.  The Howth and Skerri… [+1876 chars]",
      "full_text": "In a reprise of their Olympic debut at Tokyo 2020, Ireland’s Rob Dickson and Seán Waddilove stole a solid race win to open their World Championship series in Sardinia on Tuesday. The Howth and Skerries pairing opted to duck behind the main line of boats starting the race after spotting a gap between the fleet and the committee boat. Hitting the line exactly on the signal and already at speed, the IRL99 crew “port-tacked” away from the others in clear air as they headed for mark one with a clear lead. With the advantage of open water ahead, they extended their position over the two laps of the course and scored a memorable first place. However, that victory will be sorely needed as motivation over the coming five day. In the following two races, as the breeze first freshened and then started to fade, spotting the wind shifts against the intensity of the setting sun became challenging. Two deep results of 25th and 20th followed, leaving them with an uphill climb from which they will have to recover over the coming days. The worst race discard will likely see them drop the 25th-place finish, but this year’s event is trialling a new Olympic medal race format. As usual, the top third of the fleet will initially aim to qualify for the gold fleet. From there, the final race of the gold series will be umpired, meaning no rules protests will be held ashore afterwards which would delay results. The top four boats remaining after that race then qualify for the medal race final. In a major departure from standard competitions until now, the boat that wins the medal race is guaranteed gold. The previous first and second-placed boats would still be guaranteed a medal but would need the final win for the gold. The new format is a trial before a decision is taken by World Sailing on the matter at its annual congress, which will be held in Dún Laoghaire early next month. The proposed changes seek to satisfy the International Olympic Committee that the sport can deliver an exciting climax to competitions to address falling television audience numbers.",
      "full_text_length": 2069,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Irish sailors Rob Dickson and Seán Waddilove secured a dramatic race win at the 49er World Championships in Sardinia, using clever positioning to gain an early lead. However, they struggled in subsequent races, finishing 25th and 20th, complicating their path forward in the five-day competition.",
      "word_count": 45
    },
    {
      "title": "Call in Washington: 'Until every hostage is released from Hamas's tunnels'",
      "description": "Nearly the entire Cabinet join captivity survivors, 10.7 survivors, and family of the victims and hostages for ceremony marking the 2nd anniversary of the October 7 massacre in Washington DC.",
      "url": "https://www.israelnationalnews.com/news/415935",
      "urlToImage": "https://2.a7.org/files/pictures/000/1200412.jpg",
      "publishedAt": "2025-10-07T19:17:00Z",
      "source": {
        "id": null,
        "name": "Israelnationalnews.com"
      },
      "author": "Israel National News",
      "content": "As negotiations progress and the world marks two years since October 7th, survivors of captivity and family members of hostages gathered in Washington, D.C. to commemorate the anniversary of the mass… [+3462 chars]",
      "full_text": "As negotiations progress and the world marks two years since October 7th, survivors of captivity and family members of hostages gathered in Washington, D.C. to commemorate the anniversary of the massacre today (Tuesday). The events included a cabinet meeting with sixteen cabinet members and senior White House officials, followed by a VIP vigil attended by dignitaries from the White House, ambassadors, and faith leaders, honoring the victims and hostages of October 7th. Secretary of State Marco Rubio stated: “You have all inspired us. President Trump is committed to putting this tragedy to an end. Steve Witkoff and Jared Kushner will head to the region shortly to help bring this matter to a close. I am confident and hopeful that the next time we gather here, it will be to remember that tragic day — with all 48 hostages home.” Secretary of Commerce Howard Lutnick stated: “Almost all Cabinet members gathered here today to support the urgent call of President Trump, survivors and hostages’ families to release all the hostages now. We are in critical days and we trust Ambassador Wittkoff and the team in Egypt to finalize this agreement for a better future in the Middle East.” Captivity survivor Noa Argamani said: “I am especially grateful to President Trump for his support and commitment to the hostage deal since the day he was elected. I miss Avinatan more with every passing day. I hold onto hope, every single day, that this nightmare will end soon, and we’ll finally get to live the life we’ve dreamed of.” Captivity survivor Doron Steinbrecher said: “When the first deal collapsed, I was told I was going home. I believed it. For a moment, I felt hope. But then the sounds of war returned, and I knew it was over. The despair was crushing. After 471 days, I walked out of Gaza. But even now, I cannot truly move on. For us, there is no ‘after.’ The trauma follows you. It lives in your body. And as long as others remain in Gaza, a part of me remains there too. I cannot fully begin to heal while they are still suffering.” Arbel Yehoud, captivity survivor and partner of Ariel Cunio, stated: “I will forever be grateful to President Trump for saving my life and getting me home to my family, to my loved ones. Only because of your courage and determination, Mr. President, I stand here today. And I dare to ask, please, bring back my Ariel, his brother David, and all the remaining hostages. They must come home. Now.” Lishay Miran-Lavi, survivor of the 10.7 attack and wife of Omri Miran, said: “I came because it’s not over until it’s over - until every one of them is released from Hamas’s tunnels. Until Omri and the 47 others are home. This deal ensures that every hostage will be released within the first 72 hours. Israel has already agreed. Hamas claims it has too. Now it is time to act. No more politics. No more excuses. No more delays.” Captivity survivor Keith Siegel said: “On October 7th, 251 innocent people were kidnapped to Gaza. 42 were killed and murdered in captivity. In the past 2 years, through diplomacy and negotiations, 140 hostages have been brought back. I am here, standing in front of you today as a result of a life saving agreement. That agreement was secured through leaders who made it a priority.” Liran Berman, brother of Gali and Ziv Berman, said: “President Trump, please, don’t stop now. You’ve brought us this far. Finish what you started, what we know and trust you can. Bring my brothers home. Bring all of the hostages home. Let this be the moment the world finally acts with courage and compassion. For those still alive who are waiting to be freed, and for those who must be given the dignity of a proper burial.”",
      "full_text_length": 3682,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Survivors of Hamas captivity and families of remaining hostages gathered in Washington D.C. to mark two years since October 7th. During meetings with cabinet members and White House officials, they urged continued efforts to secure the release of 48 hostages still held in Gaza's tunnels.",
      "word_count": 45
    },
    {
      "title": "The Disney Advantage: How Women Leaders Are Transforming Women’s Sport Visibility And Growth",
      "description": "Through Disney and ESPN's strategic, long-term investment and representative leadership approach, championed by women executives, they have driven unprecedented growth in women's sports viewership and coverage.",
      "url": "https://www.forbes.com/sites/lindseyedarvin/2025/10/07/the-disney-advantage-how-women-leaders-are-transforming-womens-sport-visibility-and-growth/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/68e53d2c3921c252c5f86c8b/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
      "publishedAt": "2025-10-07T19:16:44Z",
      "source": {
        "id": null,
        "name": "Forbes"
      },
      "author": "Lindsey Darvin, Contributor,   Lindsey Darvin, Contributor  https://www.forbes.com/sites/lindseyedarvin/",
      "content": "LAS VEGAS, NEVADA - SEPTEMBER 30: ESPN reporter Holly Rowe interviews Chelsea Gray #12, A'ja Wilson #22, Jackie Young #0, Aaliyah Nye #13 and Dana Evans #11 of the Las Vegas Aces after the team's 107… [+17163 chars]",
      "full_text": "ByLindsey Darvin, Contributor. Disney and ESPN's strategic, long-term investment and representative leadership, championed by women executives, have driven unprecedented growth in women's sports. Record WNBA viewership and significant advertising revenue demonstrate this isn't a fleeting trend but a powerful movement. Their approach, treating women's sports as a core business, proves representative leadership yields strong cultural and financial results. The numbers tell a story that Rita Ferro, President of Global Advertising at Disney, has been building toward for years. The 2024 WNBA season delivered ESPN’s second most-watched coverage ever, up 170 percent year-over-year, with 54 million unique viewers and 22 games seeing over one million viewers tune in. The 2025 WNBA regular season built on this viewership success as ESPN networks recorded their most watched WNBA regular season, and a 6 percent increase from 2024 viewership numbers. The 2025 regular season games averaged 1.3 million viewers, including ESPN’s most-watched WNBA game on record when 2.7 million viewers tuned in on May 17 to watch the Chicago Sky at Indiana Fever on ABC. For Ferro and her ESPN executive counterparts, this growth was inevitable, not some huge payout from a risky bet. \"Women’s sports are one of the fastest-growing opportunities in all of sports, full stop,\" Ferro said. \"The trajectory is undeniable. We’re already seeing breakthrough moments with record ratings, sold-out arenas, and cultural relevance that rivals any other property.” Importantly, it’s becoming clear that this trajectory of women’s sport growth didn’t happen by accident. Instead, it’s the product of strategic decisions made by women leaders at both Disney and ESPN who saw opportunity when others saw uncertainty. These women leaders have been building up business cases for women’s sport while others continued to consider the industry to be a charity case. As noted by Ferro, “…diversity of thought leads to better outcomes. The more perspectives you have at the table, the stronger the decisions. And for me personally, as a working mom, I feel a responsibility to set an example, not just for my daughter, but for all young women watching what’s possible.” These sentiments became even more apparent across my recent conversations with four key Disney and ESPN executives. In addition to Rita Ferro, three ESPN executives (Roz Durant with it the Executive Vice President, Programming & Acquisitions, Tina Thornton, who is the Executive Vice President, Creative Studio and Marketing, and Chara-Lynn Aguiar, who is the Executive Vice President, Chief Financial Officer), shared similar sentiments that intentional and representative leadership has been able to create what Durant described as unstoppable momentum, \"the sky is the limit and women's sports are on a rocket ship!\" These women leaders noted that ESPN has played a key role in the women’s sports boom through decades of strategic investment, innovative partnerships, and what Ferro described as “conviction plus proof,” further noting that, “ESPN was one of the first to invest heavily in women’s sports, giving it prime exposure and treating it with the same seriousness as men’s sports.” This leadership approach provides an important blueprint for other organizations, as both Disney and ESPN are showing that representative leadership drives both cultural change and business results, even within an industry that has historically been dominated by men and men's sports. As Ferro put it, “representation matters. If you can see it, you can be it. Visibility of women leaders both inspires the next generation and normalizes women in positions of influence. That’s one of the reasons ESPN has doubled down on women’s sports, because visibility creates momentum.” And this representative leadership approach has led to one of the best sport investments to date. While other media competitors are playing catchup in trying to cash in on the momentum across women’s sports, the women leaders I spoke with at both Disney and ESPN each made sure to explain that they have been here all along. \"Women’s Sports is part of ESPN’s DNA,\" said Tina Thornton, who has been with the company for more than 30 years. \"ESPN isn’t new to Women’s Sports. We’ve been a partner of the NCAA Women’s Tournament since 1996.\" Chara-Lynn Aguiar reinforced these points from Thornton, sharing that \"this is not a new strategy for us, we have been investing in the space for many years and we have credibility.\" She noted that \"male and female executives alike all champion women's sports\" and points to recent examples including the \"WNBA, NCAA, NWSL, WLL, as well as our programming team optimizing our schedule.\" The difference in how ESPN has worked with women’s sports over the decades, especially once compared with the later-arriving competitors, have been the efforts to treat women's sports as more of a core business strategy rather than experimental or charity programming.",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Disney and ESPN's women executives are driving unprecedented growth in women's sports viewership. The 2024 WNBA season saw a 170 percent increase in ESPN coverage, with 54 million unique viewers. Leaders like Rita Ferro credit diverse leadership for this success, treating women's sports as core business.",
      "word_count": 46
    },
    {
      "title": "‘Handmaid’s Tale’ Alum Sam Jaeger To Recur In Apple’s ‘Bad Monkey’ For Season 2",
      "description": "EXCLUSIVE: Sam Jaeger (The Handmaid’s Tale, The Devil in Ohio) has joined the recurring cast of Apple TV+’s Bad Monkey, sources tell Deadline. The series hails from executive producer Bill Lawrence and is led by Vince Vaughn, who also exec produces. Based on …",
      "url": "http://deadline.com/2025/10/sam-jaeger-cast-bad-monkey-season-2-1236572388/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2025/10/Sam-Jaeger-.jpg?w=1024",
      "publishedAt": "2025-10-07T19:16:20Z",
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Rosy Cordero",
      "content": "EXCLUSIVE: Sam Jaeger (The Handmaid’s Tale, The Devil in Ohio) has joined the recurring cast of Apple TV+‘s Bad Monkey, sources tell Deadline. The series hails from executive producer Bill Lawrence a… [+1691 chars]",
      "full_text": "EXCLUSIVE: Sam Jaeger (The Handmaid’s Tale, The Devil in Ohio) has joined the recurring cast of Apple TV+‘s Bad Monkey, sources tell Deadline. The series hails from executive producer Bill Lawrence and is led by Vince Vaughn, who also exec produces. Based on Carl Hiaasen’s New York Times bestselling novel of the same name, Season 1 of Bad Monkey follows Andrew Yancy (Vaughn), who has been bounced from the Miami Police Department and is now a health inspector in the Keys. But after stumbling upon a case that begins with a human arm fished up by tourists, he realizes that if he can prove murder, he’ll be back in. He just needs to get past a trove of Floridian oddballs and one bad monkey. Related Stories Casting 'Presumed Innocent': Fiona Shaw Joins Season 2 Of Apple TV+ Legal Drama News 'The Morning Show' Star Karen Pittman Talks Mia's \"Painful Realization\" That The Status Quo Remains Intact At UBN After A Crushing Blow In Episode 403 Season 2 will be based on a new original story. In addition to Vaughn, Ortiz will reprise his Season 1 role of Rogelio, a police detective and Yancy’s best friend, as a series regular. Previously announced lead cast also includes John Malkovich as Spencer, the head of a major South Florida criminal organization, as well as Yvonne Strahovski, Jaeger’s former co-star on the Hulu hit series The Handmaid’s Tale. Watch on Deadline In addition to The Handmaid’s Tale, Jaeger also recently starred opposite Emily Deschanel in Netflix’s limited series The Devil in Ohio. He is well known for his role as Joel Graham in the NBC series Parenthood. He also played lead roles in the NBC series Law & Order True Crime: The Menendez Brothers, the ABC miniseries When We Rise, Tell Me a Story for CBS All-Access, Marc Cherry’s Why Women Kill, and Ryan Murphy/Brad Falchuk’s The Politician opposite Gwyneth Paltrow. His film credits include Blumhouse’s The Wolf Man, Steven Soderbergh’s Traffic, Clint Eastwood’s American Sniper, Paul Thomas Anderson’s Inherent Vice, and opposite Jessica Chastain and Andrew Garfield in The Eyes of Tammy Faye. He is repped by Greene Talent, Entertainment 360 and attorney John Meigs. Get our Breaking News Alerts and Keep your inbox happy. Comments On Deadline Hollywood are monitored. So don't go off topic, don't impersonate anyone, and don't get your facts wrong. Comment Name Email Website Δ",
      "full_text_length": 2365,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Actor Sam Jaeger is joining the cast of Apple TV+'s \"Bad Monkey\" for its second season. The series, starring Vince Vaughn, follows a former Miami police officer turned health inspector who investigates mysterious cases. Jaeger joins returning cast members Michelle Ortiz and John Malkovich.",
      "word_count": 44
    },
    {
      "title": "Gordon Ramsay’s ‘Knife Edge’ on Apple TV+ spotlights culinary world’s chase for Michelin glory",
      "description": "Apple TV+'s new documentary series “Knife Edge: Chasing Michelin Stars,” executive produced by Gordon Ramsay and Studio Ramsay Global… The post Gordon Ramsay’s ‘Knife Edge’ on Apple TV+ spotlights culinary world’s chase for Michelin glory appeared first on Ma…",
      "url": "https://macdailynews.com/2025/10/07/gordon-ramsays-knife-edge-on-apple-tv-spotlights-culinary-worlds-chase-for-michelin-glory/",
      "urlToImage": "https://macdailynews.com/wp-content/uploads/2025/09/250925_knife_edge.png",
      "publishedAt": "2025-10-07T19:15:44Z",
      "source": {
        "id": null,
        "name": "Macdailynews.com"
      },
      "author": "MacDailyNews",
      "content": "Knife Edge: Chasing Michelin Stars premieres Friday, October 10th, on Apple TV+.  Apple TV+’s new documentary series Knife Edge: Chasing Michelin Stars, executive produced by Gordon Ramsay and Studio… [+2526 chars]",
      "full_text": "Apple TV+’s new documentary series “Knife Edge: Chasing Michelin Stars,” executive produced by Gordon Ramsay and Studio Ramsay Global, premieres globally on Friday, October 10th. The eight-part series, hosted by Jesse Burgess, food expert and co-founder of the global food and travel platform Topjaw, takes viewers inside the emotionally charged, high-stakes world of fine dining — capturing the pressure and ambition that define the road to Michelin recognition. Marie-louise Gumuchian for Reuters: ‎ “(It) is a sort of a real reflection on what goes on in these businesses: what’s at stake, what kind of jeopardy is up for grabs and then the emotions,” Ramsay told Reuters. “This is (an)…unscripted, real version of life in the culinary world and the extent you go to for the badge of honour … Actors want Oscars, football players want F.A. Cup winners’ medals, chefs want Michelin stars.” Episodes show host Jesse Burgess meeting chefs as they compose menus, primp up dishes and seek to impress that lone diner who may be a secret Michelin inspector. There is also input from the anonymous Michelin inspectors, voiced by actors. “We ask them questions and they answer. In reality, it was all … very secretive so that none of the producers or nobody actually saw the real-life inspectors,” Burgess said. “They just judge the food on the plate.” Ramsay received his first Michelin star when he was head chef at London restaurant Aubergine. His own Restaurant Gordon Ramsay has held three stars since 2001… Asked if he still gets nervous when Michelin issues new editions of the guide, Ramsay said: “I do get nervous … no one likes losing … (going) down to even two stars is unique, but … it’s major headlines if you do. I’m often asked, ‘What would you do if you did lose a star?’ Then, I’d fight and win it back.” ‎ MacDailyNews Note: Apple TV+ is available on the Apple TV app in over 100 countries and regions, on over 1 billion screens, including iPhone, iPad, Apple TV, Apple Vision Pro, Mac, popular smart TVs from Samsung, LG, Sony, VIZIO, TCL and others, Roku and Amazon Fire TV devices, Chromecast with Google TV, PlayStation and Xbox gaming consoles, and at tv.apple.com, for $9.99 per month with a seven-day free trial for new subscribers. For a limited time, customers who purchase and activate a new iPhone, iPad, Apple TV, Mac or iPod touch can enjoy three months of Apple TV+ for free. ‎ Please help support MacDailyNews — and enjoy subscriber-only articles, comments, chat, and more — by subscribing to our Substack: macdailynews.substack.com. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon.",
      "full_text_length": 2654,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Gordon Ramsay's new Apple TV+ series \"Knife Edge\" premieres October 10th, offering viewers an intimate look at chefs pursuing coveted Michelin stars. The eight-part documentary, hosted by Jesse Burgess, captures the intense pressure and emotional journey of fine dining establishments seeking culinary excellence.",
      "word_count": 43
    },
    {
      "title": "How to Watch Tonight's Episode of 'Dancing with the Stars'",
      "description": "'Dancing with the Stars' is currently airing its 34th season. How to watch Week 4 on October 7 and find out the theme and how to watch on Hulu, Disney+ and more.",
      "url": "https://www.today.com/popculture/tv/how-to-watch-dancing-with-the-stars-october-7-rcna236146",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/rockcms/2025-10/dancing-with-the-stars-lm-251007-08e9cf.jpg",
      "publishedAt": "2025-10-07T19:15:05Z",
      "source": {
        "id": null,
        "name": "TODAY"
      },
      "author": "Joyann Jeffrey",
      "content": "The competition is getting even more fierce!  'Dancing With the Stars' is expected to air its fourth episode of Season 34 tonight. Last episode, Robert Irwin, gave fans a show when he ripped his shir… [+1946 chars]",
      "full_text": "The competition is getting even more fierce! \"Dancing With the Stars\" is expected to air its fourth episode of Season 34 tonight. Last episode, Robert Irwin, gave fans a show when he ripped his shirt off mid-performance during TikTok Night of the program. The stunt, along with his superior skills on the dance floor, earned him a score of 22/30, breaking his weeks-long tie with “The Secret Lives of Mormon Wives” star Whitney Leavitt for the top position. Leavitt, on the other hand, received one of the best scores of the night once again when she danced alongside her partner, Mark Ballas, on the show. She and Olympic gold medalist Jordan Chiles received the top score of 24/30. Sadly, one contestant went home in a shocking elimination. Scroll below to see who got the axe and how you can watch tonight's episode of \"Dancing With the Stars.\" Yes, “Dancing with the Stars” will air its fourth episode for Season 34 tonight on Oct. 7. The competition series airs live on ABC and Disney+ at 8 p.m. ET/PT and 7 p.m. CT. Episodes will be available to stream the next day on ABC.com and Hulu. The theme for the Oct. 7 episode of “Dancing with the Stars” is Disney. See the list of songs here. Last week, Fifth Harmony singer Lauren Jauregui got eliminated from the competition. She performed a cha cha to her hit single “Work From Home” while three of her Fifth Harmony bandmates — Normani, Ally Brooke, and Dinah Jane — watched in the audience. Camila Cabello, who left the group in 2016, was not in attendance. She and comedian Andy Richter received the lowest score of a night, which was an 18/30, and ultimately, Jauregui went home. When asked how she felt about being eliminated, the singer said, “Pissed.\" Joyann Jeffrey is a trending news reporter based in New York City",
      "full_text_length": 1777,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "\"Dancing with the Stars\" returns tonight at 8 p.m. ET on ABC and Disney+ with its fourth episode of Season 34, featuring a Disney theme. Last week, Fifth Harmony's Lauren Jauregui was eliminated after scoring 18/30, while Robert Irwin and Whitney Leavitt continue leading the competition.",
      "word_count": 46
    },
    {
      "title": "Busy Philipps Shares the Workout Behind Her 'Sexy Mom Era'",
      "description": "Busy Philipps thinks we could all stand to be a little more honest in our workout classes. Admittedly, it doesn't take a ton of convincing to get Philipps to share her unfiltered thoughts - but in agreeing to wear a hot mic during a Zumba class, she might've …",
      "url": "https://www.popsugar.com/fitness/busy-philipps-sexy-mom-era-49461973",
      "urlToImage": "https://media1.popsugar-assets.com/files/thumbor/5M-b53wbBUnmo6F6xh3Vo9Dgxi0=/0x0:1198x629/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2025/10/07/789/n/1922729/3d57ee1f68e5545f64b111.39878921_.png",
      "publishedAt": "2025-10-07T19:15:02Z",
      "source": {
        "id": null,
        "name": "POPSUGAR"
      },
      "author": "Chandler Plante",
      "content": "Busy Philipps thinks we could all stand to be a little more honest in our workout classes. Admittedly, it doesn't take a ton of convincing to get Philipps to share her unfiltered thoughts but in agre… [+2755 chars]",
      "full_text": "Busy Philipps thinks we could all stand to be a little more honest in our workout classes. Admittedly, it doesn't take a ton of convincing to get Philipps to share her unfiltered thoughts — but in agreeing to wear a hot mic during a Zumba class, she might've unlocked some of her most candid takes yet. \"My hips have not seen this much action in a while,\" she says mid-class in a video shared on Oct. 6. \"I look like I'm in a high school theater production.\" This venture into unfamiliar terrain is just one of the ways Philipps is stepping into her \"sexy mom era\" — a phase of life all about feeling confident and exploring what brings you joy. Although she's previously experienced symptoms of star student syndrome — trying to be the best in class or working to impress the fitness instructor — these days, she works out with herself in mind. \"The more empowered you are in yourself and what's true to you, the sexier it is to other people,\" she says. \"That's the thing that people respond to with me. They respond to the fact that I'm a little bit DGAF.\" \"Are people going to judge me? What if I need more water than some? What if I pee?\" Unfamiliar workout classes can definitely be intimidating, but as long as she's being honest, this is some of the most fun Philipps has had in a fitness setting. \"I have been looking for a new cardio workout that I don't hate,\" she tells Popsugar. \"I think it's a very relatable experience, right? You're trying a new thing for the first time, you're going by yourself, you're like, 'Oh God, am I wearing the right stuff? Are people going to judge me? What if I need more water than some? What if I pee?'\" That said, the fitness world and \"sexy mom era\" can be difficult to embrace, especially when you're faced with the pressure to make it all look picture-perfect. Philipps's advice? \"You have to let go of other people's expectations and feeling beholden to other people's ideas of what you should be doing,\" she says. \"Get in touch with what you want to do.\" She's doing her part by going on trips, re-uniting with old friends, and yes, trying new workouts that feel fun, not frustrating. Amid busy schedules and relentless feedback from the world around us, Philipps knows it can be hard to get grounded . . . but it's worth doing anyway. \"It's really important for us, all of us, to get out of our heads and into our bodies, especially women,\" she says. \"If you can take an hour every day or three times a week to just reconnect with your body, that is gonna pull you into your sexy mom era, for sure.\" Chandler Plante (she/her) is a social producer and staff writer for the Health & Fitness team at Popsugar. She has over five years of industry experience, previously working as an editorial assistant for People magazine, a social media manager for Millie magazine, and a contributor for Bustle Digital Group. She has a degree in magazine journalism from Syracuse University and is based in Los Angeles.",
      "full_text_length": 2954,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Actress Busy Philipps embraces her \"sexy mom era\" through candid Zumba workouts, wearing a hot mic to share unfiltered thoughts during class. She encourages women to focus on personal enjoyment rather than others' expectations, emphasizing body connection through fun fitness activities several times weekly.",
      "word_count": 44
    },
    {
      "title": "Texas Ends ABA’s Accreditation Monopoly in the Lone Star State",
      "description": "In the little over 100 years since its founding, the American Bar Association has transformed from an organization designed to promote best practices in the... Read More The post Texas Ends ABA’s Accreditation Monopoly in the Lone Star State appeared first on…",
      "url": "https://www.dailysignal.com/2025/10/07/texas-ends-abas-accreditation-monopoly-in-lone-star-state/",
      "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2025/10/texas-scaled-e1759863503936.jpg",
      "publishedAt": "2025-10-07T19:15:00Z",
      "source": {
        "id": null,
        "name": "Daily Signal"
      },
      "author": "Zack Smith",
      "content": "In the little over 100 years since its founding, the American Bar Association has transformed from an organization designed to promote best practices in the legal profession to one promoting partisan… [+3324 chars]",
      "full_text": "David Buono/Icon Sportswire via Getty Images In the little over 100 years since its founding, the American Bar Association has transformed from an organization designed to promote best practices in the legal profession to one promoting partisan political positions that are immoral, illegal, and unethical. But despite its woke commitments, the ABA has remained the nation’s only nationally recognized law school accreditor. On top of that, many states specifically require that those who sit for their state’s bar exam must first have graduated from an ABA-accredited law school. The ABA long ago ceased to promote best practices for legal education—leading my colleague at The Heritage Foundation and me to call for federal and state actions to end the ABA’s accreditation monopoly. In April, President Donald Trump issued an executive order explicitly criticizing the ABA’s accrediting arm for its problematic DEI practices and ordering the Department of Education to “hold accountable [consistent with applicable law], including through denial, monitoring, suspension, or termination of accreditation recognition, accreditors who fail to meet the applicable recognition criteria or otherwise violate Federal law.” Trump clarified that accreditors violate federal law by “requiring institutions seeking accreditation to engage in unlawful discrimination in accreditation-related activity under the guise of ‘diversity, equity, and inclusion’ initiatives.” That’s after U.S. Attorney General Pam Bondi had already notified the ABA it was likely breaking the law by pushing its DEI policies. Last week, Texas became the first state to adopt our main state-level recommendation, with its supreme court eliminating the requirement that an individual has to have graduated from an ABA-accredited law school to sit for the bar in that state. “The Court is of the tentative opinion that the ABA should no longer have the final say on whether a law school’s graduates are eligible to sit for the Texas bar exam and become licensed to practice law in Texas,” the Texas Supreme Court wrote. Now, it falls to the Texas Supreme Court itself to decide whether a law school qualifies as an “approved law school” eligible to have its graduates sit for, and become members of, the Texas bar. The change won’t take effect until early in 2026—after a period for public comment—but this is undoubtedly a step in the right direction. Texas isn’t the only state considering such changes. Florida’s Supreme Court is considering a similar step, and other states will likely follow suit—as they should. After all, the ABA tried to bully George Mason University’s law school into discriminating against students based on race—even going so far as to threaten the school’s accreditation unless it applied different admissions standards based on race. The ABA has pushed policies that likely violate the First Amendment by restricting what attorneys can—and cannot—say. And it even—absurdly—claimed the Equal Rights Amendment had become the 28th Amendment to the United States Constitution. That position proved so radical, legally untenable, and dangerous that even President Joe Biden’s own archivist (the official responsible for formally recognizing new constitutional amendments) rejected it, as did the D.C. Circuit Court of Appeals. Thankfully, Texas has taken a first and important step toward eliminating the ABA’s undue and unwarranted influence on legal education and the legal community more broadly. Stay tuned, because there’s likely more to come from other states and the federal government. Please log in again. The login page will open in a new tab. After logging in you can close it and return to this page. We use cookies on our website. By using our website, you consent to cookies. Learn More .",
      "full_text_length": 3791,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Texas's Supreme Court has eliminated the requirement for law school graduates to attend American Bar Association-accredited schools before taking the state bar exam. The landmark decision, effective 2026, ends ABA's century-long accreditation monopoly amid criticism of its diversity policies and partisan positions.",
      "word_count": 42
    },
    {
      "title": "U.S. commemorates Oct. 7 anniversary while anxiously following Trump-backed Gaza talks",
      "description": "Senior officials held a private meeting with Israeli representatives in Washington, shortly before a vigil co-sponsored by U.S. Secretary of Commerce Howard Lutnick's family foundation, the Hostages and Missing Families Forum and major Jewish organizations. T…",
      "url": "https://www.haaretz.com/us-news/2025-10-07/ty-article/.premium/u-s-commemorates-oct-7-anniversary-while-anxiously-following-trump-backed-gaza-talks/00000199-bfb2-db47-a1fd-fffbfa8c0000",
      "urlToImage": "https://img.haarets.co.il/bs/00000199-bfb2-db47-a1fd-fffbfa8c0000/e8/fb/1d6b6f4a42eb94ba8aa2a46a4aa1/371460.jpg?&width=1200&height=630&cmsprod",
      "publishedAt": "2025-10-07T19:13:09Z",
      "source": {
        "id": null,
        "name": "Haaretz"
      },
      "author": "Ben Samuels",
      "content": "Senior officials held a private meeting with Israeli representatives in Washington, shortly before a vigil co-sponsored by U.S. Secretary of Commerce Howard Lutnick's family foundation, the Hostages … [+171 chars]",
      "full_text": "WASHINGTON - Senior U.S. officials on Tuesday marked the second anniversary of the October 7 attacks with Israeli survivors, recovered hostages and families of slain loved ones, all while anxiously awaiting word on ongoing talks in Egypt surrounding U.S. President Donald Trump's 20-point peace proposal.",
      "full_text_length": 304,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "U.S. officials gathered Tuesday with Israeli survivors, former hostages, and victims' families to commemorate the second anniversary of the October 7 attacks. The somber event occurred as diplomatic negotiations continue in Egypt regarding President Trump's proposed 20-point peace plan for Gaza.",
      "word_count": 41
    },
    {
      "title": "FOX Sports to Air 2026 World Baseball Classic, Including March 17 Championship",
      "description": "FOX Sports will be the exclusive home for all 47 games of the 2026 World Baseball Classic, including the Championship Game on March 17.",
      "url": "https://www.foxsports.com/stories/mlb/fox-broadcasts-2026-world-baseball-classic-games-schedule",
      "urlToImage": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2025/10/1408/814/wbcmain.jpg?ve=1&tl=1",
      "publishedAt": "2025-10-07T19:12:18Z",
      "source": {
        "id": "fox-sports",
        "name": "Fox Sports"
      },
      "author": "",
      "content": "We all remember the epic conclusion to the 2023 World Baseball Classic. Japan and the United States locked in an instant classic with the title on the line. Shohei Ohtani stared down fellow MLB super… [+2333 chars]",
      "full_text": "We all remember the epic conclusion to the 2023 World Baseball Classic. Japan and the United States locked in an instant classic with the title on the line. Shohei Ohtani stared down fellow MLB superstar – and then-teammate – Mike Trout with two outs. And now we're set for the 2026 World Baseball Classic, which will once again feature the world's best players representing their countries, throughout March 2026. FOX is set to air seven games, including three Pool B games featuring the United States team, two Quarterfinals games and the World Baseball Classic Championship Game on Tuesday, March 17 from Miami’s loanDepot Park. The remaining matchups will air across FS1, FS2, the FOX Sports app, FOX One and Tubi – full schedule and designations to be announced at a later date. In addition, FOX Deportes will carry 28 tournament games in Spanish including all four Quarterfinals games, two Semifinals contests, and the Championship Game. The 2026 edition of the WBC will be the sixth iteration of the global baseball tournament that will feature 20 teams competing in four first round pools in Tokyo, Japan; San Juan, Puerto Rico; Houston, Texas; and Miami, Florida, starting on Wednesday, March 4 and Thursday, March 5, 2026. The 2023 Championship Game averaged 5.2 million viewers and peaked at 6.5 million when the game was decided in the bottom of the ninth with Ohtani and Trout, Angels teammates at the time, squaring off in one of the more memorable at-bats in recent baseball history. With FOX broadcasting Major League Baseball games since 1996, the World Baseball Classic will precede the network’s 30th season of MLB coverage. \"The World Baseball Classic embodies everything we love about the game – passion, pride and world-class talent,\" said FOX Sports Executive Vice President, Head of Programming and Scheduling Bill Wanger. \"Following the tournament’s wide-spread excitement and unforgettable finish from 2023, we’re honored to once again deliver this premier global event to fans across the country.\"",
      "full_text_length": 2024,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "FOX Sports will broadcast the 2026 World Baseball Classic, including seven key games featuring Team USA and the championship match on March 17 in Miami. The tournament will span 20 teams competing across venues in Tokyo, San Juan, Houston, and Miami starting March 4.",
      "word_count": 44
    },
    {
      "title": "Cody Johnson Makes Shock Cancelation Amid Sudden Health Crisis",
      "description": "Country singer Cody Johnson said Tuesday he has cancelled all remaining concerts this year after suffering a ruptured eardrum that requires immediate surgery.",
      "url": "https://dailycaller.com/2025/10/07/cody-johnson-country-singer-cancels-2025-concerts-ruptured-eardrum-surgery/",
      "urlToImage": "https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/10/GettyImages-1479215162-scaled-e1759864294349.jpg",
      "publishedAt": "2025-10-07T19:12:11Z",
      "source": {
        "id": null,
        "name": "The Daily Caller"
      },
      "author": "Leena Nasir",
      "content": "Country singer Cody Johnson said Tuesday he has cancelled all remaining concerts this year after suffering a ruptured eardrum that requires immediate surgery.  Johnson said the procedure and recovery… [+1352 chars]",
      "full_text": "Country singer Cody Johnson said Tuesday he has cancelled all remaining concerts this year after suffering a ruptured eardrum that requires immediate surgery. Johnson said the procedure and recovery will sideline him for weeks, making it impossible to sing. (RELATED: Rush Announces Reunion Tour In Honor Of Neil Peart) “While battling a severe upper respiratory and sinus infection, I burst my ear drum,” he wrote on Instagram. “The severity of the rupture means I must undergo immediate surgery.” A post shared by Cody Johnson (@codyjohnson) NASHVILLE, TENNESSEE – JUNE 07: Cody Johnson performs onstage during the 2024 CMA Music festival at the Nissan Stadium on June 07, 2024 in Nashville, Tennessee. (Photo by Jason Kempin/Getty Images) “The healing process will take many weeks, and it is not possible for me to sing during this time,” he continued. “Without the surgery my downtime could be months.” Johnson ended his message on a hopeful note, saying he’s praying for a full recovery so he can return to performing. A post shared by Cody Johnson (@codyjohnson) “I pray for full healing so I can get well and return to doing what I love,” he wrote. “Thank you COJO Nation for the love and support now, and always.” The singer told disappointed fans to expect updates about cancelled shows, adding, “Please stay tuned for an email from your ticket providers for further details.” A post shared by Cody Johnson (@codyjohnson) Johnson had six remaining 2025 shows on his “Leather Deluxe” tour, with stops planned in Pennsylvania, Alabama, Louisiana, Arizona and Nevada. Comments on his Instagram post were disabled, and he did not say when he expects to return to the stage.",
      "full_text_length": 1678,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Country star Cody Johnson has canceled his remaining 2025 concerts after suffering a ruptured eardrum during a severe respiratory infection. The singer requires immediate surgery and weeks of recovery, making performing impossible. The cancellations affect six shows across five states on his \"Leather Deluxe\" tour.",
      "word_count": 45
    },
    {
      "title": "Schumer: ‘Greene is absolutely right’ on health care demands",
      "description": "Senate Minority Leader Chuck Schumer (D-N.Y.) touted Rep. Marjorie Taylor Greene’s (R-Ga.) call to extend Affordable Care Act (ACA) subsidies, as he doubled down on his opposition to funding the government without addressing the expiring tax credits. In remar…",
      "url": "https://freerepublic.com/focus/f-chat/4344925/posts",
      "urlToImage": null,
      "publishedAt": "2025-10-07T19:12:02Z",
      "source": {
        "id": null,
        "name": "Freerepublic.com"
      },
      "author": "The Hill",
      "content": "Skip to comments.  Schumer: Greene is absolutely right on health care demands The Hill ^   | 10/07/25 2:15 PM ET   | Sarah Fortinsky   Posted on 10/07/2025 12:12:02 PM PDT by E. Pluribus Unum  Senate… [+3554 chars]",
      "full_text": "Posted on 10/07/2025 12:12:02 PM PDT by E. Pluribus Unum Senate Minority Leader Chuck Schumer (D-N.Y.) touted Rep. Marjorie Taylor Greene’s (R-Ga.) call to extend Affordable Care Act (ACA) subsidies, as he doubled down on his opposition to funding the government without addressing the expiring tax credits. In remarks on the Senate floor Tuesday, the Democratic leader read aloud from part of a social media post in which Greene said she’s “absolutely disgusted” that health insurance premiums could double if the ACA subsidies expire at the end of the year, breaking with her party on an issue at the center of the government shutdown standoff.“I’m going to go against everyone on this issue because when the tax credits expire this year my own adult children’s insurance premiums for 2026 are going to DOUBLE, along with all the wonderful families and hard-working people in my district,” Greene wrote in the part of the post Schumer read aloud.“So hold on to your hats,” Schumer continued in his floor remarks, after reading the post. “I think this is the first time I said this, but, on this issue, Representative Greene said it perfectly.”“Representative Greene is absolutely right,” he added.Greene, in her post on Monday night, made clear she does not support the ACA and thinks the entire health insurance system is flawed. But she criticized her party’s leadership for failing to make the expiring tax credits, which will affect many GOP constituents, more of a priority.“Not a single Republican in leadership talked to us about this or has given us a plan to help Americans deal with their health insurance premiums DOUBLING!!!” she wrote, adding, “WE HAVE TO DO SOMETHING ABOUT THE ABSOLUTELY INSANE COST OF INSURANCE FOR AMERICANS.”Schumer, in his remarks on Tuesday, blamed Speaker Mike Johnson (R-La.) for the shutdown and sharply criticized Johnson for refusing... (Excerpt) Read more at thehill.com ... TOPICS: Health/Medicine KEYWORDS: 0carenightmare; greene; marjorietaylorgreene; mtg; obamacare; schumer; zerocare Click here: to donate by Credit Card Or here: to donate by PayPal Or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794 Thank you very much and God bless you. 1 posted on 10/07/2025 12:12:02 PM PDT by E. Pluribus Unum [ Post Reply | Private Reply | View Replies] Between Massie and Schumer, she’s really nailing the endorsements 2 posted on 10/07/2025 12:15:48 PM PDT by Gene Eric [ Post Reply | Private Reply | To 1 | View Replies] To: E. Pluribus Unum Abuse was built into obamacare, with it scheduled to get worse every year, after he left office. Still hangs around your neck, Ovomit! 3 posted on 10/07/2025 12:17:24 PM PDT by Flaming Conservative ((Pray without ceasing)like he had it with him.) [ Post Reply | Private Reply | To 1 | View Replies] To: E. Pluribus Unum What the Dems want go BEYOND just giving health care to illegals, they also want to basically make the BBB null and void, they want NPR and PBS to be refunded, given trans surgeries to minors, sending BILLIONS to foreign countries, basically they just want to make the BBB totally useless 4 posted on 10/07/2025 12:19:21 PM PDT by Sarah Barracuda [ Post Reply | Private Reply | To 1 | View Replies] To: E. Pluribus Unum Schumer is just waging his jawbone. The House already approved the CR. 5 posted on 10/07/2025 12:22:47 PM PDT by Empire_of_Liberty [ Post Reply | Private Reply | To 1 | View Replies] To: E. Pluribus Unum Of course she’s right. If there’s and issue with states cheating to provide benefits to illegals...go after that with gusto. Put some folks in prison. But there’s millions of natural born Americans that depend on that subsidy to help them purchase health insurance. America First does not care about Conservative Orthodoxy. Conservative Orthodoxy supported all the offshoring/”Free trade”, open borders and endless wars that helped to create the mess we’re in. 6 posted on 10/07/2025 12:24:55 PM PDT by Mariner (War Criminal #18) [ Post Reply | Private Reply | To 1 | View Replies] To: E. Pluribus Unum Green was saying she wants to repeal the whole ACA, not continue to fund it. 7 posted on 10/07/2025 12:26:04 PM PDT by circlecity [ Post Reply | Private Reply | To 1 | View Replies] To: E. Pluribus Unum Schumer has no right to complain. Where were the Democrats (I can’t find who made this list): When millions of illegals were ushered in through the southern border, you said nothing! When they abandoned millions of dollars worth of military equipment in Afghanistan, you said nothing! When they flaunted a two-tier justice system, one for them and one for everyone else, you said nothing! When they covered up the Hunter Biden laptop, you said nothing! When they passed a trillion-dollar infrastructure bill that failed miserably, you said nothing! When they forced Americans to take an untested vaccine, you said nothing! When inflation crushed the middle class, you said nothing! When they sent billions to Ukraine, you said nothing! When chemical",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Senate Minority Leader Chuck Schumer endorsed Representative Marjorie Taylor Greene's stance on extending Affordable Care Act subsidies. Greene broke with Republican leadership, expressing concern that health insurance premiums could double when tax credits expire. Despite opposing ACA overall, she urged action on rising insurance costs.",
      "word_count": 45
    },
    {
      "title": "Catherine Connolly says there is no 'recognition' of climate emergency in Budget 2026",
      "description": "‘I don’t expect any Budget to sort out those crises, but I do expect a Budget to be put in context of the existential threat posed by climate change.’",
      "url": "https://www.thejournal.ie/catherine-connolly-says-there-is-no-recognition-of-climate-emergency-in-budget-2026-6838080-Oct2025/",
      "urlToImage": "https://img2.thejournal.ie/article/6838080/river/?height=400&version=6838092",
      "publishedAt": "2025-10-07T19:11:37Z",
      "source": {
        "id": null,
        "name": "TheJournal.ie"
      },
      "author": "Diarmuid Pepper",
      "content": "PRESIDENTIAL CANDIDATE CATHERINE Connolly has criticised the Budget and said that the government has utterly failed to learn from the Covid pandemic and the declaration of a climate emergency.  She w… [+3506 chars]",
      "full_text": "PRESIDENTIAL CANDIDATE CATHERINE Connolly has criticised the Budget and said that the government has “utterly failed to learn from the Covid pandemic and the declaration of a climate emergency”. She was speaking in the Dáil this evening in reaction to the Budget 2026 announcement in her role as an Independent TD. While she said the government has acknowledged “that the planet is burning”, she said there is no “recognition” of this in the Budget. “I don’t expect any Budget to sort out those crises,” said Connolly, “but I do expect a Budget to be put in context of the existential threat posed by climate change.” She added that “we’re failing to recognise that we can’t continue with the same, unsustainable growth approach and do something about climate change”. She also said there were no provisions in relation to public health infrastructure so that “we would be prepared for the next pandemic”. Connolly also said she was “worried” by a lack of a mention to homelessness. She also accused the government of “twisting language” around housing. “If you are in receipt of a HAP payment, you are not adequately housed in terms of social housing, and you’re twisting language on its head,” said Connolly. Connolly also said there was an “utter failure to recognise that there’s an absolute crisis of a housing problem in the Gaeltacht”. She also said that the government had “reneged on its solemn promise to do away with the means test for carers”. “I don’t know why we can go with economists telling us we have a growth economy when we’re not valuing the number of carers that are doing unpaid leave,” added Connolly. Advertisement She said the number of people providing regular unpaid care increased by over 50% between 2016 and 2022 to reach close to 300,000. Last week, Social Protection Minister Dara Calleary said that while the Government “remains committed to phasing out the carer’s allowance means test”, it cannot be done ”in a single budget” and that it will be done in a “progressive manner”. Connolly also remarked that the government has “failed to train enough people to work in our hospitals” and that these are problems that “come up year after year”. “We need to actually put out the message that they’re not inevitable,” said Connolly. Meanwhile, Connolly remarked that the €11 million increase for schemes targeting violence against women is a “drop in the ocean”. “Despite our third strategy for zero violence against women, the figures keep rising, it’s an absolute crisis.” She also warned that many people are “paying two mortgages, one for a house and one for childcare”. She said the “absolute answer is public childcare because otherwise people can’t work”. Connolly is running for the Áras against Fine Gael pick Heather Humphreys and speaking to LMFM this morning, Humphreys was asked about the government’s record on housing. She said there is a “disaster” in housing and that “billions and billions has been spent on housing and what we need to see are results”. Humphreys said that as president, she would not “let the country down”. She was also asked if she would “speak out against government policy” and replied that while the presidency is “above politics”, she “can speak out and there’s nobody better to speak out for people”. “As I said, the presidency is above politics and I can assure you that if I see wrongdoings, if I see injustices, I will speak out. “I have never been afraid to speak out for people, and as president, that’s what I will do, I will be a voice for this nation.” Readers like you are keeping these stories free for everyone... A mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article. Over 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation. Learn More Support The Journal",
      "full_text_length": 3863,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Presidential candidate Catherine Connolly slammed Budget 2026 for failing to address climate emergency concerns, despite government acknowledgment of environmental crisis. Speaking in the Dáil, she criticized the lack of sustainable growth measures and inadequate provisions for public health infrastructure, homelessness, and housing issues in Gaeltacht areas.",
      "word_count": 46
    },
    {
      "title": "Lionel Messi loses key teammate for Argentina’s FIFA World Cup 2026 opener",
      "description": "A key Argentina player will not be able to join Lionel Messi for the team’s debut at the FIFA World Cup 2026.  Just over eight months remain until the FIFA World Cup 2026 kicks off in the United States, Mexico, and Canada. Argentina will arrive looking to def…",
      "url": "https://worldsoccertalk.com/news/lionel-messi-loses-key-teammate-for-argentinas-fifa-world-cup-2026-opener/",
      "urlToImage": "https://ds-images.bolavip.com/news/image?src=https://images.worldsoccertalk.com/webp/1200_740/WST_20251007_WST_595488_messi.webp&width=1200&height=740",
      "publishedAt": "2025-10-07T19:11:27Z",
      "source": {
        "id": null,
        "name": "Worldsoccertalk.com"
      },
      "author": "Alejandro Lopez Vega",
      "content": "Just over eight months remain until the FIFA World Cup 2026 kicks off in the United States, Mexico, and Canada. Argentina will arrive looking to defend the title they won in Qatar 2022, and having Li… [+3260 chars]",
      "full_text": "By Alejandro Lopez Vega October 07, 2025 Just over eight months remain until the FIFA World Cup 2026 kicks off in the United States, Mexico, and Canada. Argentina will arrive looking to defend the title they won in Qatar 2022, and having Lionel Messi and the rest of the squad’s stars available will be crucial. However, one important player won’t be on the field for the opening match of the tournament. On Tuesday, FIFA published a list of players still serving suspensions from the September international break, and Nicolas Otamendi was among them. The Benfica defender was sent off during the World Cup qualifier against Ecuador and received a one-match suspension, along with a fine of 5,000 Swiss francs (around $6,300). With South America’s World Cup qualifiers having ended last month, Otamendi no longer has the opportunity to serve the suspension during that competition. Under these circumstances, the Argentine defender will have to wait for the next official FIFA tournament to serve the ban. Argentina’s calendar includes four friendlies between October and November, which will wrap up their 2025 schedule. In March, they have one more friendly and, very likely, the Finalissima against Spain. That match, although official, won’t count toward fulfilling the suspension, as it is not a FIFA-organized tournament but rather co-hosted by UEFA and CONMEBOL. Nicolas Otamendi of Argentina. All of this leads to a tough consequence for Argentina: Otamendi will have no choice but to serve his one-match ban in the opening game of the FIFA World Cup 2026 group stage. That’s in line with Article 9.2 of the FIFA regulations: “Pending match suspensions imposed as a result of a direct or an indirect red card in matches in the preliminary competition of the FIFA World Cup 2026 will be carried over to the final competition.” see also Bad news for Lionel Messi: Argentina star misses US October tour due to injury Nicolas Otamendi’s situation also applies to another South American star. Chelsea’s Moises Caicedo was also sent off in the same match between Ecuador and Argentina and will therefore miss his team’s opening game at the 2026 World Cup — a significant blow for Ecuador, considering the midfielder’s importance. Although rare, cases like these have occurred in previous tournaments. At the FIFA World Cup 2014 in Brazil, several players missed their teams’ openers due to suspensions carried over from earlier matches that hadn’t yet been served. Freddy Guarin missed Colombia’s opener in that tournament against Greece, a game the South Americans won 3–0. The same happened with Mario Mandzukic, who was unavailable for Croatia’s World Cup opener against Brazil, a match they lost 3–1. Like Messi, Nicolas Otamendi announced back in September that he will not take part in the next World Cup cycle. That made the match against Ecuador his final appearance in South American qualifiers. Naturally, that also means the 2026 tournament in the United States, Mexico, and Canada will be the defender’s last major competition at international level. see also Argentina National Team TV Schedule Otamendi will close out a successful run with Argentina that began in 2009 and included three World Cup appearances (South Africa 2010, Russia 2018, and Qatar 2022). Over the last 16 years, the defender has collected four titles: the 2022 FIFA World Cup, the 2021 and 2024 Copa America tournaments, and the 2022 Finalissima.",
      "full_text_length": 3435,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Argentina defender Nicolas Otamendi will miss his team's 2026 World Cup opener due to a suspension from a red card in last month's qualifier against Ecuador. The ban carries over since South American qualifiers have ended, forcing the defending champions to start without their key defender.",
      "word_count": 46
    },
    {
      "title": "6 Former Surgeons General Say RFK Jr. Is Endangering the Health of the Nation",
      "description": "The bipartisan group of surgeons general included Democratic and Republican appointees dating back to the early 1990s.",
      "url": "https://truthout.org/articles/6-former-surgeons-general-say-rfk-jr-is-endangering-the-health-of-the-nation/",
      "urlToImage": "https://truthout.org/app/uploads/2025/10/2025_1007-rfkjr.jpg",
      "publishedAt": "2025-10-07T19:11:26Z",
      "source": {
        "id": null,
        "name": "Truthout"
      },
      "author": "Truthout",
      "content": "Honest, paywall-free news is rare. Please support our boldly independent journalism with a donation of any size.  Six former U.S. surgeons general have published an op-ed in The Washington Post, warn… [+4492 chars]",
      "full_text": "Honest, paywall-free news is rare. Please support our boldly independent journalism with a donation of any size. Six former U.S. surgeons general have published an op-ed in The Washington Post, warning Americans that Robert F. Kennedy Jr. is using his role as head of the Department of Health and Human Services (HHS) to endanger the health of the nation. The authors of the op-ed, which was published on Monday, represent “former U.S. surgeons general appointed by every Republican and Democratic president since George H.W. Bush” — including Jerome Adams, Richard Carmona, Joycelyn Elders, Vivek Murthy, Antonia Novello and David Satcher. The surgeons general said that they’ve taken “two sacred oaths” in their lifetimes — one as physicians and another as public servants. “In keeping with those oaths, we are compelled to speak with one voice to say that the actions of Health and Human Services Secretary Robert F. Kennedy Jr. are endangering the health of the nation,” they wrote. Never miss the news and analysis you care about. “Despite differences in perspectives, we have always been united in an unwavering commitment to science and evidence-based public health. It is that shared principle that led us to this moment,” the authors went on, adding that Kennedy is a “driving force” behind a “crisis” of the department lacking scientific integrity and transparency. The former surgeons general said that Kennedy was unable to “restore trust” among the public when it comes to vital health initiatives, citing Kennedy’s long history of spreading lies about vaccines and his “de-emphasis” of vaccination in the face of the worst measles outbreak in the U.S. over the past three decades. They also cited Kennedy’s recent (and discredited) claim that use of acetaminophen during pregnancy is linked to autism. That claim “has been widely condemned by the scientific and medical communities, who have pointed out that the available research is inconclusive and insufficient to justify such a warning,” they wrote. Rather than combating the rapid spread of health misinformation with facts and clarity, Kennedy is amplifying it. The consequences aren’t abstract. They are measured in lives lost, disease outbreaks and an erosion of public trust that will take years to rebuild. “Secretary Kennedy is entitled to his views. But he is not entitled to put people’s health at risk,” the former surgeons general wrote. “He has rejected science, misled the public and compromised the health of Americans. The nation deserves a health and human services secretary who is committed to scientific integrity and can restore morale and trust in our public health agencies.” Kennedy has been widely condemned for his actions as head of HHS. Last month, 16 states plus Washington, D.C. sued HHS due to its threats to cut funding for sex ed classes if they included lessons on transgender people. HHS announced in August that it would no longer fund what it called “gender ideology,” baselessly claiming that lessons that acknowledge the existence of trans people would “poison the minds of the next generation.” Other examples of Kennedy’s incompetence abound. In May, for example, HHS, under his leadership, released a “Make America Healthy Again” report that included multiple errant and fraudulent citations. A deeper examination of that report revealed that it was created in large part by using Artificial Intelligence (AI), a move that experts blasted as widely irresponsible due to the technology’s tendency to completely make up “facts.” And this past summer, Kennedy dismissed the entirety of the Advisory Committee on Immunization Practices (ACIP), a Centers for Disease Control and Prevention (CDC) board that issues guidance on vaccines and other methods to prevent infection. Kennedy filled most of the vacant spots on that board with anti-vaxxers and conspiracy theorists. According to a Quinnipiac University poll published in September, only 33 percent of Americans approve of the job Kennedy has done so far, while 54 percent disapprove. In the same survey, respondents were asked how confident they were in Kennedy’s medical advice. Only 39 percent said they had confidence in the information Kennedy cited, while 57 percent said they didn’t have much confidence in him. As we rise to meet the current wave of authoritarianism, Truthout appeals for your support. Independent media is a pillar of democracy and a powerful force for justice. Please make a tax-deductible one-time or monthly donation to Truthout if you can.",
      "full_text_length": 4530,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Six former U.S. surgeons general from both Republican and Democratic administrations published a Washington Post op-ed condemning Health Secretary Robert F. Kennedy Jr.'s leadership. They accused him of endangering public health by spreading vaccine misinformation and undermining scientific integrity at the Department of Health and Human Services.",
      "word_count": 47
    },
    {
      "title": "‘Doing nothing was a lot harder than I thought’: Gen Z is now ‘rawdogging’ boredom — here’s why it’s good for them",
      "description": "A self-styled productivity influencer has mastered the art of bore after sitting in silence every day for a month to fix his 'attention span.'",
      "url": "https://nypost.com/2025/10/07/lifestyle/gen-z-rawdogs-boredom-to-fix-attention-span-and-it-works/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/10/gen-z-rawdogging-boredom-s-113003384.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2025-10-07T19:11:09Z",
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "Ben Cost",
      "content": "This is putting a lot of effort into being lazy.  Generation Zers have devised a new way to mentally detox from omnipresent digital distractions — by undertaking challenges where they do nothing all … [+4644 chars]",
      "full_text": "This is putting a lot of effort into being lazy. Generation Zers have devised a new way to mentally detox from omnipresent digital distractions — by undertaking challenges where they do nothing all day, as seen in TikTok clips with thousands of views. Dubbed rawdogging, the practice involves staring into space sans entertainment, sleep or other distractions to give themselves a respite in an age where everyone is glued to their screen. The craze initially took off this past summer aboard flights — with Gen Z ascetics filming themselves undertaking sky-high psychological fasts — but has since fanned out to other areas. In a recent series of videos, a self-proclaimed “productivity” influencer named Rowan conducted an experiment where he rawdogged for an hour each day to fix his “attention span.” He explained that he’d been struggling with a “short attention span” due to “constant dopamine hits from my phone, caffeine, sugary foods and games.” “This gave me such hard time to focus on my work and the things I really care about,” he explained, adding that he felt he needed to have his brain “wander off freely without any stimulation.” It’s safe to say it was a lot of work for “nothing.” In the first of the daily clips — a 30-second timelapse filmed on Sept. 29, 2025 — the content creator is seen sitting in a recliner fidgeting with his eyes closed at 120x speed. “Just sitting there doing nothing was a lot harder than I thought,” Rowan wrote. By day 7, the ascetic Jedi had mastered the art of “bore,” explaining that he found boredom a lot more “comfortable.” He explained that he used to use his phone everywhere, including during showering, eating and on the toilet, but had recently not felt the need to “carry it everywhere.” The rawdogging marathon also paid major dividends on his output as well. “Because I don’t need constant stimulation, I feel a lot more productive,” said Rowan. “I focus on the things that actually matter to me, like my work, relationships and being more present in the moment that matters instead of checking my phone every two seconds.” He added, “So far I’m satisfied with the results.” Many viewers lauded Rowan’s rawdogging Odyssey with one fan calling the challenge “genuinely helpful” while another wrote, “motivating.” “I couldn’t even make it through watching you do this for 1 minute,” lamented one. However, others were less impressed. Recently, I have been struggling with having short attention span. Constant dopamine hits from my phone, caffeine, sugary foods and games. This gave me such hard time to focus on my work and the things I really care about. Then I came across a challenge for fixing your attention span. The premise for this challenge is for your brain to take a break and wander off freely without any stimulation. This is my first day of this challenge. I never tried this and it was challenging. Just sitting there doing nothing was a lot harder than I thought. I’m going to be doing this challenge for 30 days to show the difference. #dopaminedetox #100dayschallenge #focus #productivity #habitstacking “Anything but doing something productive,” said one detractor. Others accused Rowan of simply rebranding “meditation,” echoing criticism of Zoomers discovering things that already exist such as “girl dinners” (AKA leftovers). Coincidentally, many experts have espoused the virtues of being disinterested. “Learning how to tolerate boredom is an important skill,” Stacey Rosenfeld, PhD, a Rockland County psychologist, previously told the Post while speaking on the perks of being bored as a child. “There are always going to be times when we’re bored. If we never allow ourselves to have that feeling of wondering ‘What should I do with this time,’ how will we do that as adults?” In fact, some experts not only endorse boredom, they prescribe it. “Dr. Carl Marci, a psychiatrist and author, claims that, after being bored for a while, his children will “start to creatively solve their problems or distract themselves with social interaction or play,” allowing them to be curious and imaginative. Constant access to personal devices and screens — which feature “content designed primarily to capture a child’s attention and engage them as long as possible” — teaches kids that “they don’t have to ever be bored,” he added. This isn’t just anecdotal, either. A study out of Texas A&M University found that boredom serves as a psychological signal to seek new experiences and grow as people.",
      "full_text_length": 4474,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Gen Z youth are embracing \"rawdogging,\" a digital detox trend where they deliberately do nothing to combat screen addiction. The practice involves sitting quietly without entertainment or distractions. TikTok creator Rowan documented his experience, reporting improved focus and productivity after practicing daily hour-long sessions.",
      "word_count": 44
    },
    {
      "title": "Cheech Marin, Teresa Ruiz, Dean Norris & Katie Tripp Round Out Cast Of Border Thriller ‘Coyote’",
      "description": "EXCLUSIVE: Filmmaker Per Prinz has rounded out the cast of Coyote, a border thriller on which we were first to report, with four additions: Cheech Marin (Up in Smoke), Teresa Ruiz (Narcos: Mexico), Dean Norris (Breaking Bad), and newcomer Katie Tripp. Describ…",
      "url": "http://deadline.com/2025/10/cheech-marin-teresa-ruiz-dean-norris-katie-tripp-join-coyote-1236572419/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2025/10/Cheech-Marin-Teresa-Ruiz-Dean-Norris-and-Katie-Tripp.jpg?w=1024",
      "publishedAt": "2025-10-07T19:09:59Z",
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Matthewgrobar",
      "content": "EXCLUSIVE: Filmmaker Per Prinz has rounded out the cast of Coyote, a border thriller on which we were first to report, with four additions: Cheech Marin (Up in Smoke), Teresa Ruiz (Narcos: Mexico), D… [+2259 chars]",
      "full_text": "EXCLUSIVE: Filmmaker Per Prinz has rounded out the cast of Coyote, a border thriller on which we were first to report, with four additions: Cheech Marin (Up in Smoke), Teresa Ruiz (Narcos: Mexico), Dean Norris (Breaking Bad), and newcomer Katie Tripp. Described as a gritty, modern-day thriller exploring the dangerous underworld of border smuggling, the film’s lead is Esai Morales. Others in key roles include Mel Gibson and Renata Notni. The story follows Hernán Barroca (Morales), a weathered ex-smuggler pulled back into the dangerous world he thought he had left behind. When Hernán helps Julia and her young daughter, Maribel, navigate treacherous borderlands, their desperate journey triggers the wrath of a ruthless trafficking syndicate. As past and present collide — with U.S. Border Patrol agent Jack Bradley (Gibson) joining the pursuit — Hernán must rely on his cunning and grit to survive and find redemption. Marin plays Javier, a beacon of strength and light in a city controlled by the cartel, with Ruiz as Gabriella, a wise and resilient woman from Nogales who looks after those in need. Norris portrays the cunning and relentless Chief Dennison, with Tripp as Liz Bradley, a border patrol agent with a true-north moral compass, in her first major film role. Watch on Deadline Prinz wrote the script with Adam J. Goldstein. Scott Smith is producing for Fire Tiger Studios, along with Hamid and Camille Torabpour of Winter State Entertainment, and Morales and his Richport Entertainment. Breaking out in the ’70s as one half of the famed comedy duo Cheech & Chong, Marin has nearly 200 film and television credits, though he’s perhaps best known for roles in Tin Cup, Born in East L.A. and Up in Smoke, as well as the CBS police procedural Nash Bridges. Ruiz first garnered attention for her work in Netflix’s Narcos: Mexico before going on to projects like the Netflix series Mo and the film Father Stu opposite Mark Wahlberg. Best known for his role as DEA agent Hank Schrader on Breaking Bad, Norris can currently be seen starring alongside Christopher Meloni on Law & Order: Organized Crime. Other credits include Little Miss Sunshine, Carry On and TNT’s Claws, to name just a few. Norris is repped by Innovative Artists — as are Marin and Ruiz. Marin is also repped by Weintraub Tobin Chediak; Ruiz by Hirsch Wallerstein Hayum; and Norris by Constellation Media Group. Tripp is repped by Marv Dauer Management and Abstract Talent Agency. Get our Breaking News Alerts and Keep your inbox happy. Comments On Deadline Hollywood are monitored. So don't go off topic, don't impersonate anyone, and don't get your facts wrong. Comment Name Email Website Δ",
      "full_text_length": 2672,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Veteran actors Cheech Marin, Teresa Ruiz, Dean Norris and newcomer Katie Tripp join the cast of border thriller \"Coyote,\" starring Esai Morales and Mel Gibson. The film follows an ex-smuggler drawn back into danger while helping a mother and daughter escape trafficking, with Gibson portraying a Border Patrol agent.",
      "word_count": 49
    },
    {
      "title": "Maria Steen calls for presidential election to be cancelled over Jim Gavin’s departure",
      "description": "Conservative campaigner missed out on required signatures to make the ballot",
      "url": "https://www.irishtimes.com/politics/2025/10/07/maria-steen-calls-for-presidential-election-to-be-cancelled-over-jim-gavins-departure/",
      "urlToImage": "https://www.irishtimes.com/resizer/v2/S3XSDFGLBR5DY6NNBR4HLL5YXI.jpg?smart=true&auth=884f87114da22f2d07c84c251ae28eecb31a4cbafadc4ed48d7f0f5a5b97cfc7&width=1200&height=630",
      "publishedAt": "2025-10-07T19:09:29Z",
      "source": {
        "id": "the-irish-times",
        "name": "The Irish Times"
      },
      "author": "Ellen Coyne",
      "content": "Maria Steen has called for the 2025 Irish presidential election to be cancelled and run again, claiming its political legitimacy has been further undermined by Fianna Fáil candidate Jim Gavin ending … [+2516 chars]",
      "full_text": "Maria Steen has called for the 2025 Irish presidential election to be cancelled and run again, claiming its political legitimacy has been “further undermined” by Fianna Fáil candidate Jim Gavin ending his campaign. Ms Steen, a conservative campaigner who had tried to run as an independent candidate, missed out on a place on the ballot paper after securing 18 of the required 20 signatures from TDs and senators before the deadline for nominations. Some of her supporters, who include social conservatives and other right-wing voters, have threatened to spoil their ballots on October 24th in protest at what they see as a lack of choice. Ms Steen’s failure to get enough support to run as a candidate also prompted criticism and online abuse of Independent TDs and Senators who declined to back her. Ms Steen says the dramatic exit of Mr Gavin from the race has “further undermined” the upcoming poll. “Democracy is supposed to mean that the people get to decide. The political legitimacy of the presidential election was already in doubt due to the closing of ranks by the major parties, which prevented any independent candidate from making it as far as the ballot,” Ms Steen said. “It has now been further undermined by the dramatic implosion of the Fianna Fáil-backed candidacy of Jim Gavin. As a result, the public is left with very little choice, and a large constituency feels totally unrepresented. “Given all that has happened, the better course at this stage would be to cancel the election and call a new one, if for no other reason than to secure public acceptance of the legitimacy of whoever is ultimately elected to serve as our next president.” Ms Steen said that if the presidential election was run again, it is “likely” that she would try to run again. [ A timeline of Jim Gavin’s short-lived push for the presidencyOpens in new window ] This month’s poll will now be the first presidential election in more than 50 years to only have two candidates actively contesting, though Mr Gavin will remain on the ballot paper. Canvassing in Louth on Tuesday, Fine Gael candidate Heather Humphreys said she was the “centre ground, common sense, pro-European candidate in this election”. “The presidency is above party politics and I am asking voters to place their trust in me so that I can bring my experience to the role of president,” Ms Humphreys said. [ Michael McDowell: Why I didn’t nominate Maria Steen for the presidencyOpens in new window ] Independent candidate Catherine Connolly, still a TD, spent much of the day in the Dáil for the Budget. On Wednesday Ms Connolly will visit the offices of Alone, the older people’s organisation, to speak about issues relating to ageism and loneliness.",
      "full_text_length": 2715,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Conservative campaigner Maria Steen demands cancellation of Ireland's 2025 presidential election after Fianna Fáil candidate Jim Gavin's withdrawal. Steen, who failed to secure enough nominations to run, claims the election's legitimacy is compromised, leaving voters with limited choice between remaining candidates Heather Humphreys and Catherine Connolly.",
      "word_count": 46
    },
    {
      "title": "Victoria’s Secret Is Returning to “Sexy.” You’re Not Going to Like Why.",
      "description": "I hate to be the person who brings up Donald Trump in conversations about thongs, but ...",
      "url": "https://slate.com/life/2025/10/donald-trump-underwear-bras-victorias-secret-show-2025.html",
      "urlToImage": "https://compote.slate.com/images/b5d5983c-2a20-4d23-afbd-8c4a49b1375a.jpeg?crop=2751%2C1834%2Cx0%2Cy0&width=1560",
      "publishedAt": "2025-10-07T19:09:11Z",
      "source": {
        "id": null,
        "name": "Slate Magazine"
      },
      "author": "Christina Cauterucci",
      "content": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.  After several years of emphasizing comfort, Victorias Secret is pivoting … [+12834 chars]",
      "full_text": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily. After several years of emphasizing comfort, Victoria’s Secret is pivoting back to sexy. CEO Hillary Super, who took over last September, said in a recent interview with the Wall Street Journal that the underwear company had made a mistake by pulling back from the showy lingerie and suggestive advertising on which it made its name. Under Super’s direction, the brand has rolled out new additions to its “Very Sexy” collection, which features harness-inspired underwear, bejeweled “maximum lift” push-up bras that promise an increase of two cup sizes, and a thong with a tassel that dangles down one’s crack. The company is still presenting plenty of new comfort-driven basics and athleticwear, but it’s also adding lace teddies, costumes fit for a Halloween sex party, bras that quit before they reach the nipple, and a crotchless, cup-less leotard. (I use that term lightly.) On social media, the brand is pushing sheer lingerie, aggressive push-up bras, flouncy floral designs, and undergarments with blingy straps emblazoned with the company name. Victoria’s Secret is also leaning back into the glitzy flamboyance of its annual lingerie fashion show, which returned last year for the first time since 2018. I hate to be the person who always brings up Donald Trump in conversations about thongs, but it’s no coincidence that the end of Victoria’s Secret’s brief period of soft-touch sexuality has come at this precise moment. The past few years in fashion have heralded a return to both traditional femininity (ruffles, ballet flats) and shameless sexiness (clothing with cutouts), a two-pronged trend that has only accelerated during Trump 2.0. A partial referendum on the feminist triumphs and atmosphere of sexual caution of the #MeToo era, the new mode is also visible in the so-called Mar-a-Lago face adopted by women in the MAGA extended universe, which wears its garish makeup and medi-spa modifications as points of pride. Taut and filler-plumped, the Mar-a-Lago face somewhat resembles a push-up bra itself. Trump is concocting a world that rewards unabashedly manufactured caricatures of femininity. Who better to capitalize on the moment than a company that has, for generations, made the straight-faced argument that the sexiest thing in the world is a stiff, sculpted undergarment that hides our softest body parts behind a forbidding wall of foam? The original decision to dilute the raciness of the Victoria’s Secret brand, made by former head Martin Waters, came in 2019, when market research showed that its customers were looking for easy-wearing undergarments at low price points. Amid renewed scrutiny on Jeffrey Epstein—a close associate of former Victoria’s Secret CEO Les Wexner—and a 2020 New York Times exposé on the sexism and sexual harassment suffered by employees and models, the company was battling a reputation for being “inappropriate and off-color,” Waters told the Journal. In came a spate of products that seemed more fit for relaxation or exercise than brazen, sexually charged trysts, dovetailing with the rise of athleisure and the surge in demand for bralettes that came with the pandemic. Ad campaigns brought in models of varying body types and focused on the garments’ comfort and value. The shift was an initial success, but eventually flopped. When Super took over from Waters last year, Victoria’s Secret was struggling, with sales on the downswing for more than two years. Having lost its hold on the mid-market American underwear drawer in a more crowded marketplace, it was ill-positioned to compete with new retailers like Kim Kardashian’s Skims, which sells sleek, neutral-toned basics, and other brands that offered a range of larger sizes. Both Super and Adam Selman, the executive creative director she tapped in the spring, have held top spots at Savage X Fenty, Rihanna’s affordable, size-inclusive lingerie brand. The new CEO says she is banking on a new interpretation of sexiness, one that appreciates a certain degree of comfort—a new bra boasts a more flexible underwire—and keeps the current body-positive outlook that was scorned by leaders of Wexner’s era. At the same time, she has tried to revive the hyperfeminine, male-gaze-oriented fantasy sold by Victoria’s Secret for decades before Waters restrained it. So far, it seems to be working: The company’s stock has risen almost 8 percent since Super took over, and in the most recent quarter, sales were up 3 percent over the same period last year, beating analysts’ estimates. To the untrained eye, Victoria’s Secret’s new offerings don’t look much different from the old ones. In fact, the shift might be too subtle for casual consumers to clock on their own—more about the brand’s photo-shoot vibes and product merchandising than any dramatic about-face in design. Perhaps customers will be wooed by the fantasy of looking like a seductive model wear",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Victoria's Secret is reverting to its provocative roots under new CEO Hillary Super, who admits moving away from sexy lingerie was a mistake. The brand is expanding its \"Very Sexy\" collection with revealing designs and push-up bras, while reviving its signature fashion show after a five-year hiatus.",
      "word_count": 47
    },
    {
      "title": "ToothFairy 2.8.8",
      "description": "ToothFairy 2.8.8 is a maintenance update of my Bluetooth menu bar utility. As annoying as Bluetooth is as a user, it’s even more so as developer. Seemingly straightforward APIs don’t work as advertised. I don’t just mean that they can fail with an error. They…",
      "url": "https://mjtsai.com/blog/2025/10/07/toothfairy-2-8-8/",
      "urlToImage": null,
      "publishedAt": "2025-10-07T19:08:10Z",
      "source": {
        "id": null,
        "name": "Mjtsai.com"
      },
      "author": "Michael Tsai",
      "content": "ToothFairy 2.8.8 is a maintenance update of my Bluetooth menu bar utility.  As annoying as Bluetooth is as a user, it’s even more so as developer. Seemingly straightforward APIs don’t work as adverti… [+1000 chars]",
      "full_text": "ToothFairy 2.8.8 is a maintenance update of my Bluetooth menu bar utility. As annoying as Bluetooth is as a user, it’s even more so as developer. Seemingly straightforward APIs don’t work as advertised. I don’t just mean that they can fail with an error. They can fail but say that they succeeded. They can succeed but say that they failed. Sometimes the synchronous API will work when the asynchronous one doesn’t or vice-versa. Sometimes the async API never calls back. With each major new macOS release, I hope it will fix some of this, but each seems to add its own new wrinkle that requires a workaround. With Tahoe, the issue is that IOBluetoothDeviceSelectorController sometimes doesn’t show devices even though they are paired with the Mac. They work and show up in System Settings but not in the Bluetooth chooser dialog to add them to a third-party app. This never seems to happen with AirPods, perhaps because their pairing is handled differently and syncs via iCloud, but it seems to be reasonably common with third-party headphones and input devices (and even Apple’s own Magic mouse/keyboard/trackpad). AirPods Bluetooth Mac Mac App macOS Tahoe 26 ToothFairy Blog Archives Tag Cloud Top Posts Recently Updated RSS Feed · Comments Mastodon · Twitter Apple News",
      "full_text_length": 1273,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "A new update to ToothFairy, the Bluetooth menu bar utility for Mac, addresses issues with device detection in macOS Tahoe. While AirPods remain unaffected, third-party headphones and Apple peripherals sometimes fail to appear in Bluetooth selection dialogs despite being properly paired.",
      "word_count": 41
    },
    {
      "title": "Government slammed for lack of childcare measures after election promises",
      "description": "Opposition and childcare services organisations said that measures outlined today will not make a dent when it comes to tackling systemic childcare issues.",
      "url": "https://www.thejournal.ie/childcare-ireland-2-6838012-Oct2025/",
      "urlToImage": "https://img2.thejournal.ie/article/6838012/river/?height=400&version=6838023",
      "publishedAt": "2025-10-07T19:06:49Z",
      "source": {
        "id": null,
        "name": "TheJournal.ie"
      },
      "author": "Eimer McAuley",
      "content": "RIGHTS GROUPS AND childcare organisations have slammed the budget allocation for early learning and childcare today, as opposition politicians have called out the Government for failing to live up to… [+6181 chars]",
      "full_text": "RIGHTS GROUPS AND childcare organisations have slammed the budget allocation for early learning and childcare today, as opposition politicians have called out the Government for failing to live up to its election-time promises on capping childcare costs. Minister for Children Norma Foley said that the Government is making an “unprecedented” investment in disability services and in children. The headline figures sound good: €3.8 billion has been secured for the delivery of disability services alongside the HSE, which we are also told is “unprecedented”, and €1.48 billion for early learning and childcare, which the Department of Children says will “reduce costs for families and increase supports for staff and providers”. However, there was no mention from the Minister or her colleagues today of the promise that both government parties made during the 2024 election that childcare costs would be capped at €200 per month for parents across the country. While there is no specific package on childcare costs in the budget, funding increased by 9%, which equates to an increase of €125 million. Foley today outlined that this funding increase will allow for over 286,000 children to benefit from the National Childcare Scheme, and for over 105,000 children to benefit from the Early Childhood Care programme. She also said that this will allow for 2,300 additional childcare places through the Government’s Core Funding Scheme. However, as Foley was outlining these measures, statements were coming in from organisations that represent childcare providers and rights’ groups that universally said that this budget was a missed opportunity to tackle systemic childcare issues, barriers to access, and spiralling waitlists. The National Women’s Council (NWC) pointed out that the planned increase in places for the rest of this year and 2026 will do little to address the list of over 50,000 children waiting on a place. Doireann Crosson, Head of Policy for the NWC said that she welcomes the overall focus on childcare in this budget, but added that it’s “disappointing” that the places promised will be offered through existing schemes “which continue to rely on private and often for-profit providers”. Early Childhood Ireland, another representative organisation for providers, said that “this approach will not address the systemic issues in our childcare system,” and that the additional places will “barely make a dent”. It was widely reported that Foley was pushing for a childcare costs package in this budget – and while her department has an overall funding increase, it falls short of putting money back in parents’ pockets or taking any major action to address the shortage of childcare places across the country. When asked by The Journal if she is disappointed that those kinds of measures aren’t provided for, and if she thinks voters who were swayed by the promise of childcare at €200 a month, Foley insisted that childcare costs will be brought down “over the lifetime of the Government”. Minister for Children Norma Foley acknowledges that childcare costs are still too high for many parents, and says that this budget will see a maximum fee cap in place for next Sept. No mention of the election promise of capping childcare costs at €200 per month. @thejournal_ie pic.twitter.com/YtsgLgK274— Eimer McAuley (@eimer_mcauley) October 7, 2025 Minister for Children Norma Foley acknowledges that childcare costs are still too high for many parents, and says that this budget will see a maximum fee cap in place for next Sept. No mention of the election promise of capping childcare costs at €200 per month. @thejournal_ie pic.twitter.com/YtsgLgK274 Advertisement In what is generally being perceived as the most austere budget in years, it seems that Foley is amongst several Ministers who had to settle for less than they would have hoped for. Foley was pressed for a response to the reaction from various groups today. In response to the comments made by the NWC, she said: “I’ve always been very clear that there are three elements to ensuring that we are accessible in this sphere, one is that we would have accessibility, two, that we reduce the costs for parents, and three, that we have staff in place who are fully trained and happy to work in the sector. “Looking forward to 2026, this is the first budget of five that will begin supporting each of those three elements, to deliver better opportunity for children, and also parents,” she said. “We’ve been very clear that this is a commitment of our Government over the next five years… we know that there are 73,000 places that are unused because we don’t have the staff,” she said. Foley pointed to the measures she has secured in this budget to get workers and providers onside with Government schemes. These include the continued rollout of the Core Funding Scheme. “Core Funding will also support improved pay for educators and school-age childcare practitioners with the implementation of the 2025 Employment Regu",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "The government faces criticism for failing to deliver on election promises to cap childcare costs at €200 monthly, despite announcing €1.48 billion for early learning. Rights groups say the 9% funding increase won't address the 50,000-child waitlist or systemic issues in childcare access.",
      "word_count": 43
    },
    {
      "title": "'Is Pam Bondi Married?' Trends on Google Search as Attorney General Faces Congress Today",
      "description": "While US Attorney General Pam Bondi faced senators over the Epstein files, Google searches about her personal life exploded. Here's what happened in the tense hearing.",
      "url": "https://www.ibtimes.com/pam-bondi-married-trends-google-search-attorney-general-faces-congress-today-3786049",
      "urlToImage": "https://d.ibtimes.com/en/full/4626694/pam-bondi.jpg",
      "publishedAt": "2025-10-07T19:06:14Z",
      "source": {
        "id": null,
        "name": "International Business Times"
      },
      "author": "Luis Vincent Gochoco",
      "content": "Attorney General Pam Bondi faced a contentious hearing on Tuesday, fielding sharp questions from senators regarding the Justice Department's handling of the Jeffrey Epstein files. The high-stakes tes… [+3074 chars]",
      "full_text": "Attorney General Pam Bondi faced a contentious hearing on Tuesday, fielding sharp questions from senators regarding the Justice Department's handling of the Jeffrey Epstein files. The high-stakes testimony, covered live by outlets like the BBC, placed her at the centre of intense political scrutiny amid a deeply polarised environment. The session was closely watched by political analysts and the public. Nevertheless, as the serious proceedings unfolded, a far different conversation gained traction online. Public curiosity shifted from policy toward her personal life, with the question 'Is Pam Bondi married?' providing a peculiar backdrop to the day's events. Inside the hearing room, senators from both parties engaged in rigorous questioning. The discussions centred on the Justice Department's handling of the recently released Jeffrey Epstein files, a topic that has generated significant public interest. Lawmakers demanded greater transparency on why certain names were redacted, pushing Ms Bondi on the department's process. According to Newsweek, the exchanges between Bondi and committee members were often sharp and confrontational, reflecting a broader public demand for accountability. Furthermore, lawmakers pressed Ms Bondi on her past statements regarding former FBI Director James Comey, which some critics have described as contradictory to her current positions. Axios reported that this line of questioning aimed to scrutinise the consistency of her leadership at the department. The hearing underscored the deep divisions and politically sensitive nature of the topics at hand. Throughout the hours-long testimony, Ms Bondi defended her department's actions with prepared and firm responses, arguing that all protocols were followed correctly. AG Pam Bondi: \"No one is above the law, that’s a quote from you, Senator Blumenthal.\" pic.twitter.com/WtTWAp30gX Despite the gravity of the proceedings, recent search interest in Ms Bondi's marital status began climbing shortly after the hearing commenced. The query 'Is Pam Bondi married?' quickly became a top trending topic related to her name. This phenomenon, often amplified by social media algorithms, highlights a common pattern where the personal lives of public figures become a focal point during moments of intense professional pressure. Such trends can sometimes overshadow the substantive policy debates at hand. This shift in focus reveals a disconnect between the critical issues debated in Washington and the topics that capture the public's immediate attention. While officials debated matters of national importance, many people were more interested in the attorney general's biography. For the record, public records indicate Pam Bondi has been married and divorced twice and is currently unmarried. This information, however, remained secondary to the significant policy implications of her testimony. The hearing concluded late in the afternoon, leaving questions about the long-term political fallout and her department's future decisions lingering in the capital. For more breaking news and analysis from the UK and around the world, follow IBTimes UK on social media and tune in daily. Join the conversation in the comments section below. Originally published on IBTimes UK",
      "full_text_length": 3269,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "During a heated congressional hearing Tuesday, Attorney General Pam Bondi faced intense questioning about the Justice Department's handling of Jeffrey Epstein files. While she defended department protocols, public attention oddly shifted online, with searches about her marital status trending alongside the serious proceedings.",
      "word_count": 43
    },
    {
      "title": "Canadian Snowbirds will replace U.S. Navy as top draw in San Francisco airshow",
      "description": "U.S. government shutdown has grounded Navy aerobatics team, but nine-member Snowbirds squadron can still perform.",
      "url": "https://nationalpost.com/news/canadian-snowbirds-navy-blue-angels",
      "urlToImage": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/10/TS2025828ED06.TS_.jpg",
      "publishedAt": "2025-10-07T19:06:01Z",
      "source": {
        "id": null,
        "name": "National Post"
      },
      "author": "Chris Knight",
      "content": "The U.S. Navys Blue Angels are traditionally the centrepiece of San Franciscos annual Fleet Week six F/A-18E Super Hornet fighter jets performing aerobatic manoeuvres in tight formation, to the delig… [+4542 chars]",
      "full_text": "The U.S. Navy’s Blue Angels are traditionally the centrepiece of San Francisco’s annual Fleet Week — six F/A-18E Super Hornet fighter jets performing aerobatic manoeuvres in tight formation, to the delight of crowds. This year, the U.S. government shutdown has grounded those navy flyers along with a host of other military craft. The navy said in a statement to media this week that, unless the shutdown is quickly quashed, military personnel will not be able to participate in the event. Meanwhile, the show must go on, and so America’s allies to the north will step in. Get a dash of perspective along with the trending news of the day in a very readable format. By signing up you consent to receive the above newsletter from Postmedia Network Inc. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of NP Posted will soon be in your inbox. We encountered an issue signing you up. Please try again Interested in more newsletters? Browse here. The Snowbirds, red-and-white Tutor trainer jets familiar to Canadians from their appearances at Toronto’s CNE airshow and other events across the country, will have pride of place in the Fleet Week show this coming weekend. Fleet Week has taken place annually over the Columbus Day Weekend since 1981. The only year that saw the event cancelled was 2013, when a 16-day U.S. government shutdown overlapped with the event. This time, organizers decided to keep going with a reduced set of performances and fly-bys. (The Blue Angels told the San Francisco Chronicle that their appearance is “paused” rather than “cancelled,” in the hopes that the government may be up and running again by Friday.) This will be the second time in a month that the Royal Canadian Air Force has saved America’s bacon. Last weekend’s Pacific Airshow in Huntington Beach, Calif., had to go on minus the U.S. Air Force Thunderbirds teams thanks to the shutdown. But the nine-strong Snowbirds team stepped up as the headliners of the show, alongside some Royal Air Force planes and parachutists from the U.K., and a number of non-military teams and pilots not affected by the shutdown. “Thank God Canada is not the 51st state yet,” Kevin Elliott, director of the show, told the New York Times, presumably in jest. He added that the organizers had been scrambling to rearrange the lineup around the sudden no-shows, but was relieved that the Snowbirds could “show up and, in a sense, save the day.” The Blue Angels are scheduled to appear in at least three more airshows over the next month: one in Georgia on the weekend of Oct. 17; and two in Florida on Oct. 25-26 and Nov. 1-2. There are no plans for the Snowbirds to fly in any of those shows. National Post has contacted the team for comment. The U.S. government shut down on Oct. 1. The longest shutdown in the nation’s history is 35 days, and began in 2018 during Donald Trump’s first presidency. Our website is the place for the latest breaking news, exclusive scoops, longreads and provocative commentary. Please bookmark nationalpost.com and sign up for our newsletters here. Our website is the place for the latest breaking news, exclusive scoops, longreads and provocative commentary. Please bookmark nationalpost.com and sign up for our newsletters here. Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information. Canadian home fragrance makers up their seasonal scent game with everything from rhubarb to tobacco leaf. Nearly 30 countries in Europe are requiring biometric scans under the new Entry/Exit System Shop the top deals across home, beauty, tech, fashion, toys, garden and more Save up to 44 per cent on TVs and streaming accessories Across various categories and price points",
      "full_text_length": 4020,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Canada's Snowbirds aerobatic team will headline San Francisco's Fleet Week airshow after the U.S. government shutdown grounded the Navy's Blue Angels. This marks the second time in a month Canadian pilots have replaced American military performers, following a similar substitution at California's Pacific Airshow.",
      "word_count": 44
    },
    {
      "title": "Liverpool given ENORMOUS Ibrahima Konate contract update",
      "description": "Liverpool have found themselves with an enormous Ibrahima Konate contract boost. It's exactly what the Reds needed.Ibrahima Konate's contract will expire at the end of the season as things stand. The ...",
      "url": "https://www.anfieldwatch.co.uk/liverpool-fc/news/liverpool-transfer-news-ibrahima-konate-real-madrid-marc-guehi-boost/",
      "urlToImage": "https://staticcdn.anfieldwatch.co.uk/images/cf/e5c6e2f1-1299-4034-9944-8dd27b55af0f-1756909705/w=1920,h=1080,fit=contain,q=85,g=auto,dpr=1,f=auto,scq=50",
      "publishedAt": "2025-10-07T19:05:00Z",
      "source": {
        "id": null,
        "name": "Anfieldwatch.co.uk"
      },
      "author": "Alex Caple",
      "content": "Liverpool have found themselves with an enormous Ibrahima Konate contract boost. It's exactly what the Reds needed.  Ibrahima Konate's contract will expire at the end of the season as things stand. T… [+2099 chars]",
      "full_text": "Liverpool have found themselves with an enormous Ibrahima Konate contract boost. It's exactly what the Reds needed. Ibrahima Konate's contract will expire at the end of the season as things stand. The Frenchman has been in some sort of talks with Liverpool for around a year now - but we're still to see anything signed. There's no question that Liverpool do want to keep Konate. The centre-back situation is messy right now and the 26-year-old is unquestionably the best person to add some solidity. He's coming into his prime, completely capable of playing at the elite level and required absolutely no bedding in. What more could Liverpool need? The problem is that other clubs would also like Konate and are free to sign him next year. Real Madrid tops that list, having been linked with him all year long. 🚨2025/26 LFC x adidas range🚨 LFC x adidas LFC x adidas LFC x adidas LFC x adidas Third Kit LFC x adidas LFC x adidas LFC x adidas LFC x adidas Third Kit But recent reports have been positive, suggesting Liverpool feel they could get a deal done here. And now a new claim appears to be a massive update to that effect. Ibrahima Konate vs Marc GuehiMarc Guehi is also out of contract in 2026. Liverpool did try to get ahead of that by signing him at the end of the summer transfer window, but Crystal Palace weren't in the right position to let go. Now other clubs are lining up to sign him, with Bayern Munich eager to be one of them. However, Christian Falk claims Bayern view Real Madrid as 'their biggest competitor' for Guehi. That's significant, given it's highly unlikely that Real Madrid push for both Guehi and Konate. If the Palace captain is a major target for them, it suggests Konate isn't. Marc Guehi is also out of contract in 2026. Liverpool did try to get ahead of that by signing him at the end of the summer transfer window, but Crystal Palace weren't in the right position to let go. Now other clubs are lining up to sign him, with Bayern Munich eager to be one of them. However, Christian Falk claims Bayern view Real Madrid as 'their biggest competitor' for Guehi. That's significant, given it's highly unlikely that Real Madrid push for both Guehi and Konate. If the Palace captain is a major target for them, it suggests Konate isn't. Or at least, he's not their priority right now. Perhaps that's because they prefer Guehi, or maybe it's because they're getting the wrong signals from Konate. Either way, it's fantastic news for Liverpool. Real Madrid feel like the only other destination for Konate right now. They're the ones who could turn his head enough to rule out a new deal at Anfield. If they're truly going all-out for Guehi, that's an enormous sign that Konate's future is with Liverpool. 🔴 Shop the LFC 2025/26 adidas home range 👉🏻 Liverpool have a NEW right-back and he's the best in the world 👉🏻 Marc Guehi is COMING: Liverpool will agree deal to sign England star 👉🏻 Liverpool legend's son is now an elite centre-back No comments yet… You must be logged in to post a comment.",
      "full_text_length": 3024,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Liverpool received a boost regarding Ibrahima Konate's contract situation as Real Madrid, previously linked with the French defender, are now prioritizing Crystal Palace's Marc Guehi. This development increases the likelihood of Konate, whose current deal expires next season, extending his stay at Anfield.",
      "word_count": 43
    },
    {
      "title": "Today’s AI hype has echoes of a devastating technology boom and bust 100 years ago",
      "description": "AI is showing some of the hallmarks of another technology’s rapid rise and fall back in the 1920s. These are the lessons we could learn.",
      "url": "https://theconversation.com/todays-ai-hype-has-echoes-of-a-devastating-technology-boom-and-bust-100-years-ago-265492",
      "urlToImage": "https://images.theconversation.com/files/694729/original/file-20251007-56-153ka6.jpg?ixlib=rb-4.1.0&rect=33%2C249%2C940%2C470&q=45&auto=format&w=1356&h=668&fit=crop",
      "publishedAt": "2025-10-07T19:04:48Z",
      "source": {
        "id": null,
        "name": "The Conversation Africa"
      },
      "author": "Cameron Shackell, Sessional Academic, School of Information Systems, Queensland University of Technology",
      "content": "A crowd gathers outside the New York Stock Exchange following the 'Great Crash' of October 1929. New York World-Telegram and the Sun Newspaper Photograph Collection, US Library of Congress  The elect… [+6446 chars]",
      "full_text": "Sessional Academic, School of Information Systems, Queensland University of Technology Cameron Shackell works primarily as a Sessional Academic at the QUT School of Information Systems. He also works one day a week as CEO of Equate IT Consulting, a firm using AI to analyse brands and trademarks. Queensland University of Technology provides funding as a member of The Conversation AU. The Conversation UK receives funding from these organisations View the full list https://doi.org/10.64628/AA.usav94mnn The electrification boom of the 1920s set the United States up for a century of industrial dominance and powered a global economic revolution. But before electricity faded from a red-hot tech sector into invisible infrastructure, the world went through profound social change, a speculative bubble, a stock market crash, mass unemployment and a decade of global turmoil. Understanding this history matters now. Artificial intelligence (AI) is a similar general purpose technology and looks set to reshape every aspect of the economy. But it’s already showing some of the hallmarks of electricity’s rise, peak and bust in the decade known as the Roaring Twenties. The reckoning that followed could be about to repeat. A century ago, when people at the New York Stock Exchange talked about the latest “high tech” investments, they were talking about electricity. Investors poured money into suppliers such as Electric Bond & Share and Commonwealth Edison, as well as companies using electricity in new ways, such as General Electric (for appliances), AT&T (telecommunications) and RCA (radio). It wasn’t a hard sell. Electricity brought modern movies, new magazines from faster printing presses, and evenings by the radio. It was also an obvious economic game changer, promising automation, higher productivity, and a future full of leisure and consumption. In 1920, even Soviet revolutionary leader Vladimir Lenin declared: “Communism is Soviet power plus the electrification of the whole country.” Today, a similar global urgency grips both communist and capitalist countries about AI, not least because of military applications. Like AI stocks now, electricity stocks “became favorites in the boom even though their fundamentals were difficult to assess”. Market power was concentrated. Big players used complex holding structures to dodge rules and sell shares in basically the same companies to the public under different names. US finance professor Harold Bierman, who argued that attempts to regulate overpriced utility stocks were a direct trigger for the crash, estimated that utilities made up 18% of the New York Stock Exchange in September 1929. Within electricity supply, 80% of the market was owned by just a handful of holding firms. But that’s just the utilities. As today with AI, there was a much larger ecosystem. Almost every 1920s “megacap” (the largest companies at the time) owed something to electrification. General Motors, for example, had overtaken Ford using new electric production techniques. Essentially, electricity became the backdrop to the market in the same way AI is doing, as businesses work to become “AI-enabled”. No wonder that today tech giants command over a third of the S&P 500 index and nearly three-quarters of the NASDAQ. Transformative technology drives not only economic growth, but also extreme market concentration. In 1929, to reflect the new sector’s importance, Dow Jones launched the last of its three great stock averages: the electricity-heavy Dow Jones Utilities Average. The Dow Jones Utilities Average went as high as 144 in 1929. But by 1934, it had collapsed to just 17. No single cause explains the New York Stock Exchange’s unprecedented “Great Crash”, which began on October 24 1929 and preceded the worldwide Great Depression. That crash triggered a banking crisis, credit collapse, business failures, and a drastic fall in production. Unemployment soared from just 3% to 25% of US workers by 1933 and stayed in double figures until the US entered the second world war in 1941. The ripple effects were global, with most countries seeing a rise in unemployment, especially in countries reliant on international trade, such as Chile, Australia and Canada, as well as Germany. The promised age of shorter hours and electric leisure turned into soup kitchens and bread lines. The collapse exposed fraud and excess. Electricity entrepreneur Samuel Insull, once Thomas Edison’s protégé and builder of Chicago’s Commonwealth Edison, was at one point worth US$150 million – an even more staggering amount at the time. But after Insull’s empire went bankrupt in 1932, he was indicted for embezzlement and larceny. He fled overseas, was brought back, and eventually acquitted – but 600,000 shareholders and 500,000 bondholders lost everything. However, to some Insull seemed less a criminal mastermind than a scapegoat for a system whose flaws ran far deeper. Reforms unthinkable during the boom years followed. The Public Utility Holding C",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "The artificial intelligence boom mirrors the 1920s electricity revolution, which transformed the US economy before leading to market speculation and crash. Like today's AI stocks, electricity companies dominated markets through complex structures, with utilities comprising 18% of NYSE listings before the 1929 crash.",
      "word_count": 43
    },
    {
      "title": "The world’s most sensitive computer code is vulnerable to attack. A new encryption method can help",
      "description": "End-to-end encryption is the gold standard to protect data – and now it can be used beyond messaging platforms such as Signal.",
      "url": "https://theconversation.com/the-worlds-most-sensitive-computer-code-is-vulnerable-to-attack-a-new-encryption-method-can-help-266236",
      "urlToImage": "https://images.theconversation.com/files/694726/original/file-20251007-56-c6cski.jpg?ixlib=rb-4.1.0&rect=0%2C1151%2C9219%2C4609&q=45&auto=format&w=1356&h=668&fit=crop",
      "publishedAt": "2025-10-07T19:04:23Z",
      "source": {
        "id": null,
        "name": "The Conversation Africa"
      },
      "author": "Qiang Tang, Associate Professor, Computer Science, University of Sydney, Moti Yung, Adjunct Research Professor, Computer Science, Columbia University, Yanan Li, PhD Candidate, School of Computer Science, University of Sydney",
      "content": "Joan Gammell/Unsplash  Nowadays data breaches aren’t rare shocks – they’re a weekly drumbeat. From leaked customer records to stolen source code, our digital lives keep spilling into the open.   Git … [+4926 chars]",
      "full_text": "Associate Professor, Computer Science, University of Sydney Adjunct Research Professor, Computer Science, Columbia University PhD Candidate, School of Computer Science, University of Sydney Qiang Tang receives funding from Google via Digital Future Initiative to support the research on this project. Moti Yung works for Google as a distinguished research scientist. Yanan Li is supported by the funding from Google via Digital Future Initiative for doing this research at the University of Sydney. University of Sydney provides funding as a member of The Conversation AU. The Conversation UK receives funding from these organisations View the full list https://doi.org/10.64628/AA.rpm7duptf Nowadays data breaches aren’t rare shocks – they’re a weekly drumbeat. From leaked customer records to stolen source code, our digital lives keep spilling into the open. Git services are especially vulnerable to cybersecurity threats. These are online hosting platforms that are widely used in the IT industry to collaboratively develop software, and are home to most of the world’s computer code. Just last week, hackers reportedly stole about 570 gigabytes of data from a git service called GitLab. The stolen data was associated with major companies such as IBM and Siemens, as well as United States government organisations. In December 2022, hackers stole source code from IT company Okta which was stored in repositories on GitHub. Cyberattackers can also quietly insert malicious code into existing projects without a developer’s knowledge. These so-called “software supply-chain” attacks have turned development tools and update channels on git services into high-value targets. As we explain in a new conference paper, our team has developed a new way to make git services more secure, with very little impact on performance. We already know how to keep conversations private: secure messenger services such as Signal and WhatsApp use end-to-end encryption, which locks messages on your device and only unlocks them on the recipient’s device. This protects the data even if the service platform is hacked, which is why it’s considered the gold standard to protect data. But git services, which are widely used by major tech companies and startups, currently don’t use end-to-end encryption. The same is true for most of the other tools we use to work together, such as shared documents. Because git services allow a huge number of collaborators to work on the same project at the same time, the software codes they host are constantly written and updated at a very rapid rate. This makes using standard encryption impractical. To do so would take up too much bandwidth to transmit all of the data for even one word change, and make the services very inefficient. But our new encryption method overcomes this challenge. The method we have developed uses what’s known as “character-level encryption”. This means only edits to a software code stored on the git service are treated as new data to be encrypted – rather than the entire code. Think of it as encrypting the tracked changes in a word document, instead of a new version every time. This method strikes an important balance. It keeps the updated code private and secure while reducing the amount of communication between user and git services, as well as the amount of storage required. Importantly, this new method is also compatible with existing git services, making it easy for people to adopt. It also doesn’t interfere with other functions of git servers, such as hosting, saving bandwidth and indexing, so people can keep using these servers as they normally would – just with the added benefit of extra security. This new tool is currently free and open-source for all users. It can be installed easily like a patch when using git services, and will run in the background as users access git services just like before. But this is just the starting point for a broader shift towards online collaboration that is secured by end-to-end encryption. Extending the same guarantees to shared documents, spreadsheets and design files is possible, but will require sustained research and investment. One complication to ensure security is managing encryption keys or credentials for users to decrypt encrypted data. Fortunately, our previous research shows us how to create a secure cloud storage system that will allow users to safely store their credentials. Just as importantly, we must balance security with compliance and accountability. Universities, hospitals and government agencies are required to retain and, in some cases, provide lawful access to certain data. Meeting these obligations, without weakening end-to-end encryption, pushes us to research new techniques. The goal is not secrecy at all costs, but verifiable controls that respect both privacy and the rule of law. We don’t need a brand new internet to get there. We need pragmatic upgrades that fit the tools people already use – paired with clear, provable guarantees",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "A breakthrough encryption method could protect vulnerable git services, which host critical software code, from cyberattacks. The new \"character-level encryption\" system, developed by researchers, secures code repositories without compromising performance, addressing recent data breaches affecting major companies like IBM and government organizations.",
      "word_count": 42
    },
    {
      "title": "EXCLUSIVE CLIP: Rauw Alejandro Surprises a Classroom with Salsa Lesson on 'Celebrity Substitute'",
      "description": "In the upcoming episode of YouTube's hit series Celebrity Substitute, Rauw Alejandro trades his tour wardrobe for a trench coat and glasses, stepping in as a disguised substitute teacher to deliver a surprise lesson in salsa music and dance.",
      "url": "https://www.ibtimes.com/exclusive-clip-rauw-alejandro-surprises-classroom-salsa-lesson-celebrity-substitute-3786043",
      "urlToImage": "https://d.ibtimes.com/en/full/4626685/rauw-alejandro-teaches-salsa-celebrity-substitute.jpg",
      "publishedAt": "2025-10-07T19:04:15Z",
      "source": {
        "id": null,
        "name": "International Business Times"
      },
      "author": "Alicia Civita",
      "content": "You have known Rauw Alejandro, Raulito, Raúl, El Zorro, but have you ever heard of Rauw Alejandro el maestro? Of course not, but you will in the upcoming episode of YouTube's hit series Celebrity Sub… [+3176 chars]",
      "full_text": "You have known Rauw Alejandro, Raulito, Raúl, El Zorro, but have you ever heard of Rauw Alejandro el maestro? Of course not, but you will in the upcoming episode of YouTube's hit series Celebrity Substitute, in which the Latin superstar trades his tour wardrobe for a trench coat and glasses, stepping in as a disguised substitute teacher to deliver a surprise lesson in salsa music and dance. With a wink to his theatrical side, Rauw enters dressed like a 1970s detective and briefcase in hand. \"What's up, class!\" he says in a deadpan voice, before the room explodes in wave of shocked laughter and applause as students realize who's standing in front of them, as you can see in this exclusive clip for The Latin Times. He is there to teach about \"the Caribbean and the Caribbean sound. Salsa, What is Salsa. They are going to learn what is salsa today,\" he explains as the describes dance and salsa dance in particular as \"freedom.\" Of course, Rauw ends the lesson the only way he knows how: with a full-blown dance party, with Rauw's new song Mirando Al Cielo, as the soundtrack. The clip is part of Season 2 of Celebrity Substitute, which premiered September 10 and continues rolling out new episodes every other Wednesday through December. The show, hosted by Julian Shapiro-Barnum (Recess Therapy) and executive produced by EGOT (Emmy, Grammy, Oscar, Tony) winners Benj Pasek and Justin Paul (Ampersand), brings celebrities into real classrooms to surprise students with unexpected lessons on all kinds of topics, from music to literature and science to self-expression. Rauw's episode is set to debut on this Wednesday, October 8, joining a star-studded lineup that includes Renée Rapp, Role Model, Gigi Hadid, Ed Sheeran, Malala Yousafzai, and more. Rauw Alejandro's surprise teaching moment comes on the heels of a major artistic and personal chapter. In late September, he released Cosa Nuestra: Capítulo 0, a conceptual album rooted in salsa, reggaetón, and Afro-Caribbean rhythms, and a continuation of his 2024 record Cosa Nuestra. The project was praised for blending nostalgia with experimentation and for honoring Latin musical lineage. Just weeks earlier, Rauw was honored with the Hispanic Heritage Award for Vision, recognizing his impact on global Latin culture and his genre-expanding contributions to music. His Cosa Nuestra World Tour 2025 has drawn sold-out crowds across Latin America, the U.S., and Europe. In that context, his turn as a substitute teacher feels both playful and intentional. Produced in collaboration with Amazon, each Celebrity Substitute episode includes a moment where the company clears items from a featured teacher's Amazon Classroom List, a new tool designed to streamline how educators request materials and receive support. Viewers can directly contribute to real classrooms, transforming surprise celebrity moments into tangible resources for teachers and students. \"Celebrity Substitute works because it pairs joy with generosity,\" said Julian Shapiro-Barnum. \"Rauw brought heart, rhythm, and soul to his lesson, and the kids were all in.\" With his signature charisma, a salsa playlist, and a message of cultural pride, Rauw Alejandro reminds us that Latin music doesn't just fill stadiums, it inspires classrooms, too. Originally published on Latin Times © Latin Times. All rights reserved. Do not reproduce without permission.",
      "full_text_length": 3384,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Puerto Rican superstar Rauw Alejandro surprised students as a disguised substitute teacher in YouTube's \"Celebrity Substitute\" series. Dressed in a trench coat and glasses, he taught salsa music and dance, culminating in a classroom dance party. The episode debuts October 8 alongside appearances from Ed Sheeran and Gigi Hadid.",
      "word_count": 49
    },
    {
      "title": "State to provide €9m for Ryder Cup preparations next year",
      "description": "Funding to be allocated for bypass around Adare village, which will host golf competition in 2027",
      "url": "https://www.irishtimes.com/your-money/2025/10/07/state-to-provide-9m-for-ryder-cup-preparations-next-year/",
      "urlToImage": "https://www.irishtimes.com/resizer/v2/YYNRJJ3LH252VW453PMHAGBRI4.jpg?smart=true&auth=ee879a68a07c403739c6a15b3cb7dbf5032d5815ba9359ed020a6de4dceb5561&width=1200&height=630",
      "publishedAt": "2025-10-07T19:03:49Z",
      "source": {
        "id": "the-irish-times",
        "name": "The Irish Times"
      },
      "author": "Martin Wall",
      "content": "The Government is to potentially provide 9 million next year towards hosting the Ryder Cup golf competition in Ireland.  Funding is also being targeted towards the long-planned bypass of the village … [+2677 chars]",
      "full_text": "The Government is to potentially provide €9 million next year towards hosting the Ryder Cup golf competition in Ireland. Funding is also being targeted towards the long-planned bypass of the village of Adare in Co Limerick, where the Ryder Cup is scheduled to be held in 2027. Minister of State at the Department of Communications, Culture and Sport Charlie McConalogue said there will be a significant increase in funding for major sporting events. He told The Irish Times there are a number of line items in the budget for such events, but the Ryder Cup is the most significant of these. “We are very much looking forward to hosting (the event) in two years, and there is €9 million projected at this point for the Ryder Cup,\" he said. “The countdown to Ireland hosting the 2027 Ryder Cup and Euro 2028 is firmly on, and we will continue to invest in these and other major sports events in 2026. Ensuring that these events leave a lasting legacy for communities, drive economic growth, and impact positively on sports participation will continue to be a priority.” Separately, Minister for Public Expenditure Jack Chambers said funding will be provided for the Adare bypass road in Co Limerick. Funding for the Adare bypass was one of a number of projects announced as part of an overall €19.1 billion investment in capital projects in Budget 2026. This represents an increase of €2 billion on the 2025 figure. Mr Chambers said this allocation would provide the funding to progress “thousands of new build social homes, major water infrastructure projects and flood relief schemes, build sustainability and resilience in our electricity grid, boost our electricity supply and major projects across the transport, health, education, justice, arts and sport sectors”. He said €7.2 billion in capital funding would be allocated to housing. This includes €2.9 billion to support the delivery of thousands of new build social homes and the second-hand acquisitions programme. It also incorporates €1.2 billion for a starter homes programme, which aims to deliver thousands of starter homes through a range of supports alongside the Help to Buy initiative. The Minister said €300 million will support the regeneration of towns and urban areas. The Government will give €1.4 billion to Uisce Éireann to “continue to build essential capacity to support new housing developments and to increase the resilience and sustainability of water supply”, he said. This will “help to further progress development of waste treatment plants across the country”, he said. Some €3.5 billion will be allocated to ESB and EirGrid to “strengthen our energy security and accelerate our transition to renewable energy”, the Minister said. Capital funding for next year will also progress delivery of more than 300 school building projects, most of which are expected to be finished in 2026 and 2027, he said.",
      "full_text_length": 2883,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Ireland's government plans to allocate €9 million for the 2027 Ryder Cup preparations, alongside funding for Adare village bypass in Limerick, where the tournament will be held. Minister Charlie McConalogue confirmed the investment, emphasizing the event's significance among upcoming major sporting events in Ireland.",
      "word_count": 44
    },
    {
      "title": "O2Gold Provides Update on Quebec Aur Transaction",
      "description": "NOT FOR DISTRIBUTION TO U.S. NEWS WIRE SERVICES OR FOR DISSEMINATION IN THE U.S. TORONTO, Oct. 07, 2025 (GLOBE NEWSWIRE) — O2Gold Inc. (NEX:OTGO.H) (“O2Gold” or the “Company”) is pleased to provide an additional update on its pending acquisition of a gold min…",
      "url": "https://financialpost.com/globe-newswire/o2gold-provides-update-on-quebec-aur-transaction-4",
      "urlToImage": null,
      "publishedAt": "2025-10-07T19:03:30Z",
      "source": {
        "id": "financial-post",
        "name": "Financial Post"
      },
      "author": "GlobeNewswire",
      "content": "NOT FOR DISTRIBUTION TO U.S. NEWS WIRE SERVICES OR FOR DISSEMINATION IN THE U.S.  THIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLY  Subscribe now to read the latest news in your city and across Canada. … [+5858 chars]",
      "full_text": "NOT FOR DISTRIBUTION TO U.S. NEWS WIRE SERVICES OR FOR DISSEMINATION IN THE U.S. TORONTO, Oct. 07, 2025 (GLOBE NEWSWIRE) — O2Gold Inc. (NEX:OTGO.H) (“O2Gold” or the “Company”) is pleased to provide an additional update on its pending acquisition of a gold mining exploration property in Quebec through the purchase of all of the issued and outstanding shares of Quebec Aur Ltd. (the “Target”) pursuant to a share exchange agreement entered into by the Company with the Target and its shareholders dated April 15, 2024, as amended November 14, 2024 (the “Acquisition”). The Company received an extension from the TSX Venture Exchange to close its previously announced non-brokered private placement financing of 18 million units and 16 million flow-through common shares for aggregate gross proceeds to the Company of $1.7 million (the “Offering”). The Company now has until November 7, 2025, to close the Offering. Get the latest headlines, breaking news and columns. By signing up you consent to receive the above newsletter from Postmedia Network Inc. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Top Stories will soon be in your inbox. We encountered an issue signing you up. Please try again Interested in more newsletters? Browse here. The parties continue to work diligently to complete the remaining legal formalities in relation to the Acquisition, which is now expected to close (along with the Offering) in late-2025, subject to the satisfaction or waiver of certain conditions. The Acquisition is more fully described in the Company’s press releases dated April 15, 2024, April 23, 2024, April 24, 2024, May 30, 2024, and August 23, 2024, as well as the Company’s management information circular (the “Circular”) which was mailed to shareholders of record as of August 26, 2024. Additional information respecting the Offering can be found in the Company’s press releases dated April 8, 2025, and August 7, 2025. The press releases and Circular are available under O2Gold’s profile on SEDAR+ at www.sedarplus.ca. About O2Gold O2Gold is a mineral exploration company. For additional information, please contact: Scott Moore, Chief Executive OfficerPhone: (416) 861-1685Email: smoore@miningsm.com Regulatory Statements This press release contains “forward-looking information” within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the Offering and Acquisition, including closing conditions and timing, and other matters related thereto. Generally, forward-looking information can be identified by the use of forward-looking terminology such as “plans”, “expects” or “does not expect”, “is expected”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates” or “does not anticipate”, or “believes”, or variations of such words and phrases or state that certain actions, events or results “may”, “could”, “would”, “might” or “will be taken”, “occur” or “be achieved”. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company, as the case may be, to be materially different from those expressed or implied by such forward-looking information, including but not limited to: receipt of necessary approvals; general business, economic, competitive, political and social uncertainties; future mineral prices and market demand; accidents, labour disputes and shortages and other risks of the mining industry. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws. This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the “U.S. Securities Act”) or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available. NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEA",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "O2Gold Inc. has received an extension from TSX Venture Exchange until November 7, 2025, to complete its $1.7 million private placement financing. The company continues to progress on acquiring Quebec Aur Ltd.'s gold mining exploration property, with both transactions expected to close by late 2025.",
      "word_count": 45
    },
    {
      "title": "Lionel Messi breaks silence after Inter Miami’s Jordi Alba announces his professional retirement",
      "description": "Following an extensive career, Jordi Alba announced his retirement from soccer at season's end with Inter Miami. Lionel Messi swiftly reacted to this, sharing a heartfelt comment on his post.   After joining Inter Miami in the 2023-24 season, Jordi Alba becam…",
      "url": "https://worldsoccertalk.com/news/lionel-messi-breaks-silence-after-inter-miamis-jordi-alba-announces-his-professional-retirement/",
      "urlToImage": "https://ds-images.bolavip.com/news/image?src=https://images.worldsoccertalk.com/webp/1200_740/WST_20251007_WST_595463_GettyImages-2179660693.webp&width=1200&height=740",
      "publishedAt": "2025-10-07T19:02:58Z",
      "source": {
        "id": null,
        "name": "Worldsoccertalk.com"
      },
      "author": "Daniel Villar Pardo",
      "content": "After joining Inter Miami in the 2023-24 season, Jordi Alba became a key player for the team. At 36 years old, he managed to remain the undisputed left back, despite competition from younger players.… [+2623 chars]",
      "full_text": "By Daniel Villar Pardo Updated on October 07, 2025 After joining Inter Miami in the 2023-24 season, Jordi Alba became a key player for the team. At 36 years old, he managed to remain the undisputed left back, despite competition from younger players. He has not only been a key part of the defensive line, but also a key part of the offense. Despite this, Jordi recently announced his retirement at the end of the season, prompting Lionel Messi to leave a heartfelt comment on his post. On his Instagram profile, Jordi Alba posted a video announcing his retirement at the end of the season with Inter Miami, with the caption “Thank you soccer, thank you for so much.” Lionel Messi was quick to react, “Thank you, Jordi. I’m going to miss you a lot. After so many things together, it’s going to be strange to look to my left and not see you there… It’s crazy how many assists you gave me over all these years… Who’s going to give me the back passes now???”. Throughout his career, Jordi Alba has established himself as one of Lionel Messi’s most effective partners, with the duo contributing to an impressive 48 goals together. Their connection transcended mere statistics, however, as their intuitive on-field understanding consistently generated scoring opportunities in every match. This synergy undoubtedly ranks him among the most formidable teammates in Messi’s career. Jordi Alba has cemented his legacy at Inter Miami since joining as a veteran presence. Over 95 appearances, the Spanish full-back has tallied 14 goals and 28 assists, showcasing his extraordinary influence on the pitch. As the Herons advance in the 2025 MLS Playoffs, Alba’s contributions could help steer them toward their first-ever MLS Cup triumph, marking a milestone in franchise history. Jordi Alba of Spain poses for a photograph with the UEFA Nations League trophy. Over an illustrious 18-year career, Jordi Alba has carved out a legacy as one of the premier left-backs in Spanish soccer. Initially beginning his career as a left winger, he found his true calling at Valencia CF, where his transformation into a left-back drew the attention of FC Barcelona. In 2012, the Catalan giants—where Alba had trained as a youth—brought him back to the fold, cementing his status as one of the most significant players in their storied history. see also How many trophies has Jordi Alba won? Complete trophy list with Barcelona, Inter Miami, and Spain Upon joining Barcelona, Alba swiftly cemented his status as one of Lionel Messi’s most reliable teammates. His consistent performances earned him a permanent spot in the starting lineup for over a decade. During his decorated tenure, he clinched 20 major titles with both Barcelona and the Spanish national team. Additionally, he played a pivotal role in securing Inter Miami’s first two championships, bringing his professional title count to 22.",
      "full_text_length": 2873,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Inter Miami defender Jordi Alba announced his retirement at season's end, prompting an emotional response from teammate Lionel Messi on Instagram. The 36-year-old Spanish left-back, who joined Miami in 2023, formed a prolific partnership with Messi throughout their careers, contributing to 48 goals together.",
      "word_count": 44
    },
    {
      "title": "West Elm Coupons: Save Up To 60% On Furniture And Décor",
      "description": "Save up to 60% on modern furniture and décor with these top West Elm coupons and deals.",
      "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/west-elm-coupons/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/68e41cdc712785bd9c24fa35/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
      "publishedAt": "2025-10-07T19:02:27Z",
      "source": {
        "id": null,
        "name": "Forbes"
      },
      "author": "Bianca Alvarez, Forbes Staff,   Bianca Alvarez, Forbes Staff  https://www.forbes.com/sites/forbes-personal-shopper/people/biancaalvarez/",
      "content": "West Elm is home to modern furniture and décor thats built to last. Our editors routinely turn to the retailer when it comes to furnishing their homes and patios. In fact, West Elm makes their pick f… [+3200 chars]",
      "full_text": "ByBianca Alvarez andBrianna Lapolla West Elm is home to modern furniture and décor that’s built to last. Our editor’s routinely turn to the retailer when it comes to furnishing their homes and patios. In fact, West Elm makes their pick for the best sleeper sofa (the Shelter Queen Sleeper Sofa) and the best patio sofa (the Caldera Sofa). While these pieces tend to sit at a higher price point, West Elm coupons can help you save significantly at checkout. This week, you can save as much as 60% on popular pieces for every room. Below, we’ve rounded up the best West Elm promo codes and offers available now. If you’re a frequent West Elm shopper, consider signing up for The Key Rewards Program. The Silver Rewards tier is free to join and lets you earn 2% back in rewards every time you shop—not just at West Elm, but also at Pottery Barn, Williams Sonoma and other sister brands. Members also get early access to select sales, exclusive offers and special perks throughout the year. It’s an easy way to make those home upgrades and furniture splurges feel a little more rewarding. West Elm hasn’t announced its 2025 Black Friday sale yet, but, based on previous years, we’re expecting steep markdowns. Typically, the retailer kicks things off in the days leading up to Thanksgiving, offering up to 70% off furniture, décor and holiday hosting essentials. If you’ve had your eye on a big-ticket piece, this is one of the best times to splurge. Plus, Key Rewards members usually get an extra discount. If you’re a frequent West Elm shopper, applying for a West Elm Credit Card could be worth it. Cardholders earn 5% back in rewards across all Williams-Sonoma brands—including West Elm, Pottery Barn, Rejuvenation and Mark & Graham—and get free standard shipping on eligible orders. You’ll also get early access to major sales throughout the year, which can help you score trendy home goods before they sell out. No, West Elm doesn’t allow coupon stacking. West Elm has a 30-day return policy for eligible items, starting from the day you receive your order. To get a full refund or credit, you’ll need to provide a receipt or proof of purchase. You can start a return in-store, online or over the phone, depending on the specific item your returning. West Elm occasionally offers free standard shipping, but there is a delivery fee for most orders. Shipping costs range from $5.95 to $429 depending on item size, shipping speed and service type (parcel, doorstep or in-home delivery). No, West Elm doesn’t offer an immediate discount for joining its email list. No, West Elm doesn’t currently offer a student discount. No, West Elm doesn’t currently offer a military discount. Designers and other business owners can apply for West Elm’s B2B (business-to-business) program. Once approved, members get exclusive services, special pricing and discounts starting at 20% off.",
      "full_text_length": 2873,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "West Elm's latest sale offers up to 60% off modern furniture and home décor. Shoppers can find significant discounts on popular items, including the retailer's highly-rated Shelter Queen Sleeper Sofa and Caldera Patio Sofa. The Key Rewards Program provides additional savings for frequent customers.",
      "word_count": 44
    },
    {
      "title": "Telcos face surprise 'stress test' within weeks as Optus fallout continues",
      "description": "The adequacy of Australia's emergency call network will be stress tested with a surprise drill ahead of bushfire season, as the opposition ramps up its assault over the communication minister's handling of last month's fatal triple-0 outage.",
      "url": "https://www.abc.net.au/news/2025-10-08/surprise-drill-for-telcos-as-coalition-goes-after-wells/105863244",
      "urlToImage": "https://live-production.wcms.abc-cdn.net.au/ceba792b291b52c9d9ee65f192ffe675?impolicy=wcms_watermark_news&cropH=850&cropW=1511&xPos=89&yPos=41&width=862&height=485&imformat=generic",
      "publishedAt": "2025-10-07T19:02:02Z",
      "source": {
        "id": "abc-news-au",
        "name": "ABC News (AU)"
      },
      "author": "Maani Truu and Isabella Tolhurst",
      "content": "The adequacy of Australia's emergency call network will be stress tested with a surprise drill ahead of bushfire season, as the opposition ramps up its assault over the communication minister's handl… [+6043 chars]",
      "full_text": "Topic:Federal Government Anika Wells was hammered with questions about the government's response to the outage on Tuesday. (ABC News: Matt Roberts) Australia's telecommunications companies will be subject to a surprise outage simulation to test their triple-0 systems. The drill was agreed to during a meeting between the minister and the heads of Optus, TPG and Telstra, which coincided with the introduction of a bill to enshrine a so-called \"Triple Zero Custodian\" — one of the key recommendations in a report handed down 18 months ago. A telecommunication expert believes such a custodian could go a long way to prevent extended outages like the recent Optus incident, which has been linked to a number of deaths. The adequacy of Australia's emergency call network will be stress tested with a surprise drill ahead of bushfire season, as the opposition ramps up its assault over the communication minister's handling of last month's fatal triple-0 outage. Communications Minister Anika Wells summoned the bosses of Australia's telecommunications companies to Parliament House on Tuesday, almost three weeks after a 13-hour Optus outage was linked to multiple deaths in South Australia and Western Australia. She emerged from the meeting with a list of priority actions aimed at bolstering the network against further disasters and an agreement from the telcos to submit to a simulated outage facilitated by the National Emergency Management Agency, which the government wants to see happen within weeks. Ms Wells said the drill would identify \"where this system is not currently working for people\", while she put the blame for the recent outages squarely on the Singaporean-owned telco. \"The only thing that could have stopped Optus from having this outage was Optus themselves,\" she said in Question Time, as she withstood a barrage of questions about her response to the incident from the opposition benches. Details of how the test will function are still being worked out and Shadow Communications Minister Melissa McIntosh expressed surprise that such drills were not already occurring. Melissa McIntosh has called for an independent investigation into the incident as well as a public register of triple-0 outages. (ABC News: Matt Roberts) \"You would think that telcos would be doing this anyway, that it would be a responsibility for them to be checking their systems,\" she said. \"I don't know that it will particularly change things, and the expectation is already there that they do that.\" The meeting — which the telco chiefs described as \"constructive and important\" in a joint statement afterwards — coincided with the government's introduction of a bill to give a so-called \"Triple Zero Custodian\" powers to oversee the entirety of the system. A custodian was one of the key recommendations of the Bean Review, which was commissioned in the aftermath of an earlier Optus network outage that impacted 10 million customers and handed down 18 months ago, sparking questions over why it was not enshrined sooner. Shadow Communications Minister Melissa McIntosh said she only received a draft of the bill the night before it was introduced, describing the short time for review as \"unusual\". The Coalition agrees with the need to introduce a triple-0 custodian in principle, but support for the bill remains subject to partyroom approval. \"Of course we support the intent of the legislation, we want to protect Australians … but the government has been sitting on the recommendations of the Bean Review for a year and a half,\" Ms McIntosh said. \"And then all of a sudden they want to rush legislation through the parliament, so we have questions about their intent. \"I would hate for the legislation just to be a bureaucratic answer … we want things to actually make a difference to the triple-0 network.\" The government accepted all 18 of the Bean recommendations when the report was handed down, but a year and a half later, Ms Wells said five were still yet to be fully implemented. Telecommunications experts have had mixed opinions on whether the recommendations, if they were in place, would have prevented the Optus outage, but associate professor Paul Gardner-Stephen from the Flinders College of Science and Engineering believes a Triple Zero Custodian \"makes all the sense in the world\". He argued that was because during the September outage, it appeared as if the failed calls had not been monitored by Optus and \"that's exactly the kind of thing the Triple Zero Custodian, you imagine, would be monitoring and making public, in fact\". Under that scenario, he said, the custodian could immediately raise the alarm, notify senior levels of the telco and instruct them to launch a critical incident response without the hours-long delay that occurred in reality. \"It would be orders of magnitude faster; instead of it being 13 hours, I would have thought that within 13 minutes, under a triple-0 custodial regime, Optus would have been alerted,\" he said. \"The balance of probab",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Australian telecom companies will undergo surprise outage simulations to test triple-0 emergency systems following a recent Optus network failure linked to multiple deaths. Communications Minister Anika Wells announced the drills after meeting with major telco executives, alongside plans to establish a \"Triple Zero Custodian\" oversight role.",
      "word_count": 46
    },
    {
      "title": "Industry warns 'no gas, no future' amid high prices and falling demand",
      "description": "A future made in Australia? Not if gas prices keep rising, major manufacturers warn as they call for urgent action to secure affordable supply.",
      "url": "https://www.abc.net.au/news/2025-10-08/bluescope-steel-mark-vassella-press-club-speech-on-gas-crisis/105856934",
      "urlToImage": "https://live-production.wcms.abc-cdn.net.au/01db1b0a021ddd18a639e975599a18f5?impolicy=wcms_watermark_news&cropH=900&cropW=1600&xPos=0&yPos=69&width=862&height=485&imformat=generic",
      "publishedAt": "2025-10-07T19:01:48Z",
      "source": {
        "id": "abc-news-au",
        "name": "ABC News (AU)"
      },
      "author": "Rhiana Whitson",
      "content": "Australia's biggest manufacturers have warned the nation's 'broken' east coast gas market could cost thousands of jobs and derail the government's Future Made in Australia policy.  In a speech to the… [+8855 chars]",
      "full_text": "Topic:Oil and Gas Mark Vasella says BlueScope Steel workers — and Australia — face industrial decline without a gas reservation policy. (ABC Illawarra: Tim Fernandez) In a speech to the National Press Club today, Mark Vassella will warn Australia is at risk of following the UK's industrial decline. He and other industry leaders say without cheaper gas, the federal government's Future Made in Australia policy is doomed. Mr Vassella's address will build pressure on the government as it reviews the gas market. Australia's biggest manufacturers have warned the nation's \"broken\" east coast gas market could cost thousands of jobs and derail the government's Future Made in Australia policy. In a speech to the National Press Club in Canberra today, BlueScope Steel chief executive Mark Vassella will warn Australia risks repeating the United Kingdom's industrial decline if the federal government fails to fix the gas market. He said the UK's experience — driven by high energy costs and poor policy decisions — should serve as a \"cautionary tale\" for Australia. \"Australian manufacturing is at a dangerous crossroad,\" Mr Vassella said. Australian manufacturing is facing a worrying future, says Mr Vasella. (Supplied: GFG Alliance) \"Major change is required to fix our broken gas market and reinstate a fair domestic price. \"If we can't, we face a decline in manufacturing, similar to that which we've seen in the UK steel industry.\" Mr Vassella, a member of Manufacturing Australia, is urging the federal government to adopt an east coast gas reservation policy and a $10-a-gigajoule price cap to guarantee affordable supply for domestic manufacturers. The industry group says reserving even one-third of current east coast production would be enough to meet domestic manufacturing and residential needs, while still allowing most gas to be exported. It says immediately reserving uncontracted gas would bring rapid relief for east coast manufacturers struggling with soaring energy costs. Mark Vasella is taking his message to the National Press Club. (Kelly Fuller) \"Despite our massive gas reserves, Australia has one of the highest wholesale gas prices among producer nations in the world,\" Mr Vassella said. \"Worse, the adoption of a pricing mechanism that is based on LNG export prices means that local gas users are effectively paying for export infrastructure they don't use. \"This is not right. It increases local gas prices and puts local gas users at a structural disadvantage.\" Mr Vassella also calls for new gas supply to be brought online quickly. Frustration in the sector is at boiling point after years of policy interventions that have failed to bring down prices. Mr Vassella's National Press Club address will heap pressure on the federal government, which is conducting a gas market review due later this year. Manufacturers argue that, despite gas demand across eastern Australia falling by about 20 per cent in a decade, they are still paying some of the highest prices in the world. Last year, the average price for wholesale gas in Australia was an average $10.30 a gigajoule, compared with $2.20 in Qatar and $3 in the United States. Manufacturing Australia — which includes executives from major gas users such as BlueScope Steel — says the federal government's $12-a-gigajoule wholesale gas cap has failed to deliver. \"The intention was for that to be a cap — it's not; it's effectively a floor,\" Manufacturing Australia chief executive Ben Eade told ABC News. Mr Eade said newer offers were typically more expensive. The slump in eastern Australia gas prices per gigajoule since 2023. (Supplied: Australian Energy Producers) Mr Eade said some manufacturers were facing contract offers of up to $20 a gigajoule. \"It shouldn't be controversial to say that in a country like Australia — which is awash with gas — we should be able to supply domestic customers first, while still maintaining a thriving and globally significant export industry,\" he said. \"This isn't a choice between the two, but for the past 10 or 15 years, we've effectively chosen the interests of exporters over those of domestic customers.\" The sector's frustration is backed by the ACCC's gas inquiry September interim report, which found recent federal interventions — including the gas market code, the heads of agreement with LNG exporters and the domestic gas security mechanism — had delivered \"no material improvement\" for major users. Gas demand in eastern Australia has been falling across most sectors for the past decade. (Supplied: IEEFA) The regulator also warned supply shortfalls could re-emerge by mid-2026 if uncontracted LNG continues to be shipped offshore. Joshua Runciman, lead analyst for Australian gas at the Institute for Energy Economics and Financial Analysis (IEEFA), said east coast prices were high because the market was tightly linked to international LNG. \"LNG prices have increased quite a lot in recent years. This is compounded by the domestic market not having e",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "BlueScope Steel CEO Mark Vassella warns Australia faces industrial decline without cheaper gas prices and a reservation policy. Speaking at the National Press Club, he urged the government to implement price caps and reserve east coast gas production to protect manufacturing jobs and domestic supply.",
      "word_count": 45
    },
    {
      "title": "California Bans Loud Streaming Commercials",
      "description": "Netflix, Disney+ and the other major streamers will have to turn down the volume starting July 1, 2026, under new legislation signed into law by Gov. Gavin Newsom The post California Bans Loud Streaming Commercials appeared first on TheWrap.",
      "url": "https://www.thewrap.com/california-loud-streaming-commercial-ban/",
      "urlToImage": "https://www.thewrap.com/wp-content/uploads/2022/04/GettyImages-1321115829.jpg",
      "publishedAt": "2025-10-07T19:01:37Z",
      "source": {
        "id": null,
        "name": "TheWrap"
      },
      "author": "Lucas Manfredi",
      "content": "Netflix, Disney+ and the other major streamers will have to dial down the volume on their commercials in California after Governor Gavin Newsom signed a law banning advertisements that are louder tha… [+2627 chars]",
      "full_text": "Netflix, Disney+ and the other major streamers will have to dial down the volume on their commercials in California after Governor Gavin Newsom signed a law banning advertisements that are louder than the main video content being watched. The move, which builds on Congress’ Commercial Advertisement Loudness Mitigation (CALM) Act passed in 2010, would require streamers to comply with the volume limits starting July 1, 2026. “We heard Californians loud and clear, and what’s clear is that they don’t want commercials at a volume any louder than the level at which they were previously enjoying a program,” Newsom said in a statement. The legislation comes after the Federal Communications Commission has received thousands of complaints in the past several years about loud commercials on broadcast, cable, and satellite television. In February, the FCC said the number took a “troubling jump last year, which warrants a second look.” Senator Thomas Umberg, who is the author behind the legislation, said it was inspired by his legislative director, Zach Keller, who complained that loud streaming commercials were waking up his infant daughter, Samantha. “SB 576 brings some much-needed peace and quiet to California households by making sure streaming ads aren’t louder than the shows we actually want to watch,” Umberg added. Umberg’s bill initially faced opposition from The Motion Picture Association and Streaming Innovation Alliance, who represent the major entertainment conglomerates. “Unlike in the broadcasting cable network environment, where advertisers sell their ads directly to the networks, streaming ads come from several different sources and cannot necessarily or practically be controlled by streaming platforms,” MPA vice president of state government affairs, Melissa Patack said in testimony last year. “The technology that encodes and inserts ads from advertisers and third party intermediaries into programming occurs in real time.” At the time, Patack noted that the Audio Engineering Society and the Interactive Advertising Bureau were already working address loudness issues and develop best practices to match the loudness of ads with programming. She added that many streaming services publish audio specifications to advertisers, ad networks and ad exchanges and request source coding from advertisers so that they can make “reasonable efforts to normalize ad loudness.” The opposition was later dropped after Umberg amended the bill to add legal provisions that would protect streamers from lawsuits from private entities and leave enforcement to the state attorney general’s office. Representatives for the MPA, SIA, Paramount and Prime Video declined to comment. Netflix, Disney, Warner Bros. Discovery, Peacock and Apple TV+ did not immediately return TheWrap’s request for comment.",
      "full_text_length": 2820,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "California Governor Gavin Newsom signed legislation requiring streaming services to match commercial volumes with regular programming by July 2026. The law, inspired by complaints about loud ads waking sleeping children, builds on the 2010 CALM Act and will be enforced by the state attorney general.",
      "word_count": 45
    },
    {
      "title": "Sora 2 Has a Huge Financial Problem",
      "description": "'People are generating much more than we expected per user, and a lot of videos are being generated for very small audiences.' The post Sora 2 Has a Huge Financial Problem appeared first on Futurism.",
      "url": "https://futurism.com/artificial-intelligence/sora-2-financial-problem",
      "urlToImage": "https://futurism.com/wp-content/uploads/2025/10/sora-2-financial-problem.jpg",
      "publishedAt": "2025-10-07T19:01:15Z",
      "source": {
        "id": null,
        "name": "Futurism"
      },
      "author": "Victor Tangermann",
      "content": "It didn’t take long for OpenAI’s text-to-video-and-audio AI generator app, Sora 2, to melt down into a messy pile of potentially copyright-infringing AI slop.  Within just days, the TikTok-style app’… [+4208 chars]",
      "full_text": "It didn’t take long for OpenAI’s text-to-video-and-audio AI generator app, Sora 2, to melt down into a messy pile of potentially copyright-infringing AI slop. Within just days, the TikTok-style app’s mind-numbing feed of AI-generated content was filled with videos of Nickelodeon’s SpongeBob SquarePants cooking up blue crystals in a meth lab, entire episodes of South Park, and depictions of physicist Stephen Hawking being brutalized in horrible ways. The app’s prominent use of recognizable intellectual property and the likenesses of real people, combined with its sheer amount of hype, has allowed it to shoot up to the top of Apple’s App Store, with Meta’s competing Vibes app, which was released less than a week before Sora 2, quickly turning into a long-forgotten footnote in AI slop history. All that success creates a problem for OpenAI: how to stop Sora 2 from burning through cash as users generate countless resource-intensive AI videos. In an update posted to his personal blog, OpenAI CEO Sam Altman admitted that the company had a lot of work to do, especially when it comes to turning its AI slop generator into a moneymaker. “We are going to have to somehow make money for video generation,” he said. “People are generating much more than we expected per user, and a lot of videos are being generated for very small audiences.” It’s a pressing issue for the firm because of the sheer amount of computing power needed to generate AI videos. Last month, researchers from the open-source AI platform Hugging Face found that the energy demands of text-to-video generators quadruple when the length of videos doubles, suggesting the power required increases quadratically, not linearly. Multiply those demands by the number of videos being generated on Sora 2, and OpenAI is likely looking at massive compute demands. In other words, OpenAI’s foray into slop-based social media could quickly turn into a very costly endeavor. And turning Sora 2 into a source of revenue won’t be easy. It’s not clear that users will actually pay to use the service — and adding to OpenAI’s woes, rightsholders could soon be asking questions about its eyebrow-raising ask-for-forgiveness-later approach to intellectual property and content moderation. The company has since slammed on the brakes, implementing guardrails on Sora 2 that were mysteriously absent on day one, as copyright lawyer Aaron Moss pointed out in a recent article. Users are running into the company’s content blocks at full force, resulting in widespread frustration. As Altman’s blog post indicates, the company doesn’t have a fleshed-out plan on how to generate revenue. Some of the proceeds, according to the CEO, will be shared “with rightsholders who want their characters generated by users.” But where those proceeds will come from — presumably, either from advertising or users — remains unclear. “The idea — perhaps similar to YouTube’s ad-monetization program for videos that include copyrighted material — would give studios a financial incentive to opt in,” Moss wrote in his piece. “When thousands of GPU-intensive ten-second ‘South Park’ clips also risk copyright lawsuits, the math gets ugly fast,” he added. But if “studios become partners rather than adversaries, OpenAI can potentially offset costs while buying legal cover.” Wooing rightsholders to OpenAI’s side, especially now that the company has allowed for potentially copyright-infringing material to proliferate widely, is far easier said than done. Indeed, major rightsholders have already filed lawsuits against generative AI companies. Case in point, just last month, Warner Bros. Discovery sued AI text-to-image generator company Midjourney for infringement, joining Disney and NBC Universal. “There’s a world of difference between studios collecting YouTube ad revenue on video clips they produce and control, and handing over their characters for anyone to freely manipulate in exchange for a few bucks,” Moss wrote. Other netizens pointed out that copyright holders may balk at OpenAI’s courting attempts. “Why on earth would any brand pay for their IP to be surfaced by a user prompt upon their requests?” one argued. “That’s not even close to how any of this works.” “Why would I, as a multibillion-dollar rightsholder, not just take you to the cleaners?” another user added. More on Sora 2: OpenAI’s Sora 2 Already Melting Down Into Outrageous Drama",
      "full_text_length": 4404,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "OpenAI's Sora 2 text-to-video app faces financial challenges as users generate excessive AI videos featuring copyrighted content. CEO Sam Altman acknowledges the high computing costs and need for monetization. The app's content includes unauthorized use of characters like SpongeBob and requires costly processing power.",
      "word_count": 44
    },
    {
      "title": "Scientists Prove That Human Gut Bacteria Can Survive a Trip to Space Without Us",
      "description": "The findings have major implications for humanity's plans to explore Mars.",
      "url": "https://gizmodo.com/scientists-prove-that-human-gut-bacteria-can-survive-a-trip-to-space-without-us-2000668819",
      "urlToImage": "https://gizmodo.com/app/uploads/2025/10/news-payload-1220x732px-1200x675.jpeg",
      "publishedAt": "2025-10-07T19:00:49Z",
      "source": {
        "id": null,
        "name": "Gizmodo.com"
      },
      "author": "Passant Rabie",
      "content": "Space travel is not for the weak. Astronauts endure motion sickness, disorientation, cardiovascular stressand that’s before they even reach orbit. Luckily, the bacteria that lives inside us is far mo… [+3248 chars]",
      "full_text": "Space travel is not for the weak. Astronauts endure motion sickness, disorientation, cardiovascular stressâand that’s before they even reach orbit. Luckily, the bacteria that lives inside us is far more resilient. A new study shows that a gut bacteria essential for human health can survive the stress of being launched into space aboard a rocket, the microgravity environment, and reentry into Earth’s atmosphere. A group of scientists in Australia launched spores of Bacillus subtilis, a gram-positive bacteria that lives in our intestinal tracts, to the edge of space to see how the microbes fared. Upon examination after the bacteria had returned to Earth, the scientists found the microbes had experienced no change in their ability to grow and that their structure remained intact. The findings are detailed in a study published Monday in npj Microgravity. The work indicates that the bacteria would likely work as needed inside the guts of any humans on their way to Marsâcrucial information for astronaut health. But it also suggests that human-led contamination of Mars with Earthly bacteria may be inevitable. Previous experiments on board the International Space Station (ISS) have shown that certain types of bacteria can survive in space. There hasn’t been much research done, however, on the effects of a rocket launch and reentry on the survival rates of human gut bacteria. In order to put the bacteria to the test, the researchers packed spores on board a sounding rocket and launched it to an altitude of around 160 miles (260 kilometers) above the surface of Earth. During the second stage burn, the rocket experienced a maximum acceleration of 13 G (or 13 times the force of Earth’s gravity). Once it reached its desired altitude, the researchers initiated a brief period of weightlessness that lasted for around six minutes as the main engine shut off. After that, the rocket began its descent to Earth, decelerating at forces up to 30 G while spinning at a rate of 220 times per second. After the grueling journey, the researchers examined the bacteria spores to see how they fared during the rocket launch and reentry. Surprisingly, the bacteria showed no change to their structure, nor did the extreme forces affect its ability to grow. “Our research showed an important type of bacteria for our health can withstand rapid gravity changes, acceleration and deacceleration,â Elena Ivanova, a professor at the Royal Melbourne Institute of Technology in Australia, and co-author of the study, said in a statement. “Itâs broadened our understanding on the effects of long-term spaceflight on microorganisms that live in our bodies and keep us healthy. This means we can design better life support systems for astronauts to keep them healthy during long missions.” The idea of bacteria surviving and thriving on their way to the Red Planet, however, isn’t always met with enthusiasm. The findings follow a separate study published last year which warned bacteria not only have the potential to survive a trip to Mars, but also feel right at home in the Martian soil.Â As space agencies plan for human missions to Mars, there is growing concern that those missions could contaminate the Martian environment with out Earthly microbes. That could lead to mistaken discoveries of life on the planet, but it could also pose an immediate risk to the astronauts themselvesâor indeed, any life that might be on Mars in the first place.",
      "full_text_length": 3456,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Australian scientists discovered that Bacillus subtilis, a vital gut bacteria, can survive extreme space conditions including rocket launch, microgravity, and reentry. The bacteria showed no structural changes after enduring forces up to 30G during test flights, promising news for astronaut health during long-term missions.",
      "word_count": 44
    },
    {
      "title": "When and Where You Can Ride the NEW Bluey Ride",
      "description": "This is all you need to know about the brand new Bluey ride coming soon! The post When and Where You Can Ride the NEW Bluey Ride first appeared on the disney food blog.",
      "url": "https://www.disneyfoodblog.com/2025/10/07/when-and-where-you-can-ride-the-new-bluey-ride/",
      "urlToImage": "https://www.disneyfoodblog.com/wp-content/uploads/2024/08/2024-D23-the-ultimate-disney-fan-experience-expo-bluey-bingo-meet-and-greet-characters-2-700x567.jpg",
      "publishedAt": "2025-10-07T19:00:47Z",
      "source": {
        "id": null,
        "name": "disneyfoodblog.com"
      },
      "author": "Lauren Writtenberry",
      "content": "While we still have not seen Bluey spotted at Disney World yet, there is one place you will be able to ride a Bluey-themed attraction soon!  Bluey and Bingo!  Its no secret that Bluey has taken the w… [+2329 chars]",
      "full_text": "While we still have not seen Bluey spotted at Disney World yet, there is one place you will be able to ride a Bluey-themed attraction soon! Bluey and Bingo! It’s no secret that Bluey has taken the world by storm. The Australian pup and her lovable Heeler family have turned everyday moments into must-watch adventures, winning over kids and adults alike. With its mix of heart, humor, and life lessons, the show has become one of the most beloved family series in recent years. Now, Bluey is ready to leap from the screen into the theme park world. Bluey fans, it’s time to pack your bags, because everyone’s favorite blue pup is about to get her very own ride! That’s right, the lovable Heeler family is heading to the theme park world in a major way. Alton Towers Resort in the United Kingdom has announced that CBeebies Land will be home to the world’s first-ever Bluey ride, set to open in spring 2026. If you’re already thinking, “How do I get there?” — trust us, we’re right there with you. ©Alton Towers But the fun doesn’t stop at the ride. Visitors will also be able to enjoy Heeler family meet-and-greets, a live Bluey experience inside Big Fun Showtime, and even what Alton Towers calls the ultimate Bluey sleepover. Yes, the CBeebies Land Hotel is offering immersive Bluey-themed rooms where you’ll feel like you’ve stepped straight into the cartoon itself. If you’re wondering whether I’m tempted to book a plane ticket across the pond immediately… let’s just say my suitcase is already half-packed. ©Alton Towers Disney already teased in 2024 that Bluey would be joining Disneyland Resort in California and Walt Disney World in Florida, as well as Disney Cruise Line, sometime in the future. So far, her official debut has only happened at sea, but the announcement of a full ride overseas could signal that BBC is ready to bring even bigger Bluey plans to life. ©Alton Towers On January 10th, Bluey and Bingo made their Disney Cruise Line debut on sailings originating from Australia and New Zealand. The Heeler sisters have been making a splash on board, with a character meet and greet and an interactive game, and a dance party. A total dream for Bluey fans! Bluey! Until then, we’ll be keeping a close eye on both Alton Towers and Disney’s next moves. Whether you’re in the U.K. or the U.S., it feels like Bluey’s theme park era is just getting started. Be sure you keep following Disney Food Blog for more news on theme parks. Which Disney World park do you think Bluey would be great at? Tell us in the comments below!",
      "full_text_length": 2539,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Alton Towers Resort in the UK will unveil the world's first Bluey-themed ride in spring 2026 at CBeebies Land. The attraction will feature meet-and-greets with the Heeler family, live shows, and themed hotel rooms. Bluey already appears on Disney Cruise Line sailings from Australia.",
      "word_count": 44
    },
    {
      "title": "The Best Prime Day TV Deals (2025)",
      "description": "These are our favorite Prime Day TV Deals at every price point.",
      "url": "https://www.wired.com/story/prime-day-tv-deals-october-2025/",
      "urlToImage": "https://media.wired.com/photos/68e0b6e7026132543e222e55/191:100/w_1280,c_limit/The%20Best%20Prime%20Day%20TV%20Deals%20This%20Fall.png",
      "publishedAt": "2025-10-07T19:00:44Z",
      "source": {
        "id": "wired",
        "name": "Wired"
      },
      "author": "Ryan Waniata",
      "content": "Prime Day is here (again), and that means it's a great time to consider swapping out your aging TV for a cost-friendly upgrade. We've hunted down the best Prime Big Deal Days TV sales simmering ahead… [+2596 chars]",
      "full_text": "All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more. Prime Day is here (again), and that means it's a great time to consider swapping out your aging TV for a cost-friendly upgrade. We've hunted down the best Prime Big Deal Days TV sales simmering ahead of the holidays, with options for every budget and use case. These picks are pulled from the best TVs we've tested, so you can be assured they'll fill your living room with dazzling colors, killer contrast, and general 4K HDR awesomeness. Don't forget to check out our Absolute Best Prime Day Deals roundup and our Prime Day Liveblog for great deals on all sorts of products so you can stock up, get your holiday shopping done early, and enjoy that Pumpkin frappacino in peace. Samsung Amazon (65-inch) Walmart (55-inch) We've tested several of the best OLEDs this year that rank among the top screens we've ever seen, but Samsung's S95F is special. Its secret weapon is Samsung's latest anti-reflective screen, which does a phenomenal job keeping all but the most intense direct reflections at bay, while only minimally affecting black levels and perceived depth. Pair that with breakthrough OLED brightness, near-infinite contrast, fantastic colors, and pristine picture processing, and you've got the best premium TV for any environment. It doesn't support Dolby Vision, but otherwise, there's nary a trick this TV doesn't cover, including top-notch gaming features to make it an all-around dazzling entertainment centerpiece. TCL Amazon Walmart TCL Best Buy TCL's QM6K (8/10, WIRED Recommends) doesn't blast you with brightness, but its utilization of TCL's all-new screen tech provides a remarkably balanced picture, offering sweet and naturalistic colors, impressive image processing, and impressive black levels with very little noticeable blooming. The TV offers plenty of other benefits, including an intuitive Google TV interface, along with topline gaming features like VRR at up to 144 Hz across two of its four HDMI inputs. It's a whole lot of goodness for your money, making it one of the best bargains you'll find. TCL Amazon Walmart We're huge fans of TCL's full-sale display revamp for 2025, which is a big reason two of its top TVs made our deals list. The QM8K is a major step up from the QM6K in brightness (we're talking like four times brighter) for a dazzling picture and vivid colors, while still maintaining excellent black levels, making it a great watch in any setting. This is premium performance for a mid-tier price, especially now that it's on sale, alongside great features and an even speedier Google TV interface. It's still not going to compete with our favorite OLED TVs when it comes to black levels or off-axis viewing, but it gets pretty dang close for your money, making this a steal of a deal. Power up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
      "full_text_length": 3078,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Prime Day returns with major TV discounts ahead of the holidays. Standout deals include Samsung's S95F OLED featuring advanced anti-reflective technology, TCL's balanced QM6K with Google TV interface, and TCL's ultra-bright QM8K. All models offer premium features and 4K HDR capabilities at various price points.",
      "word_count": 45
    },
    {
      "title": "The true story of Alfred Hitchcock's 'Psycho' isn't like it's depicted in Netflix's 'Monster: The Ed Gein Story'",
      "description": "Netflix's 'Monster: The Ed Gein Story' takes some creative liberties with the real story of making Alfred Hitchcock's 'Psycho.'",
      "url": "https://www.businessinsider.com/monster-ed-gein-netflix-alfred-hitchcock-psycho-fact-check-2025-10",
      "urlToImage": "https://i.insider.com/68e3c7f2cc993f9955cf956b?width=1200&format=jpeg",
      "publishedAt": "2025-10-07T19:00:35Z",
      "source": {
        "id": "business-insider",
        "name": "Business Insider"
      },
      "author": "Jason Guerrasio",
      "content": "Alfred Hitchcock shows Anthony Perkins the Ed Gein house in 'Monster: The Ed Gein Story.'Netflix  <ul><li>Episode two of 'Monster: The Ed Gein Story' focuses on the making of Alfred Hitchcock's 'Psyc… [+5620 chars]",
      "full_text": "Every time Jason publishes a story, you’ll get an alert straight to your inbox! By clicking “Sign up”, you agree to receive emails from Business Insider. In addition, you accept Insider’s Terms of Service and Privacy Policy. Netflix's \"Monster: The Ed Gein Story\" appears to have taken some creative liberties when depicting the making of Alfred Hitchcock's \"Psycho.\" Ryan Murphy's twisted anthology series, which focuses on different infamous killers each season like Jeffrey Dahmer and the Menendez brothers, turns to the granddaddy of them all for season 3: Ed Gein, the 1950s-era serial killer who inspired horror classics like \"Psycho\" and \"The Texas Chainsaw Massacre.\" A majority of episode two of \"The Ed Gein Story\" focuses on a series of events that suggest Gein's crimes inspired Hitchcock. The legendary filmmaker, played by Tom Hollander on the show, is shown having meetings with \"Psycho\" author Robert Bloch and even walking his star Anthony Perkins (Joey Pollari) through a replica of Gein's house on the \"Psycho\" set to get him in the right mindset to play Norman Bates. But according to Tony Lee Moral, who has written several books on Alfred Hitchcock and his movies, many of the details of this episode are a Ryan Murphy fantasy. In one scene, Perkins believes he's having rehearsals with his costar Janet Leigh, but Hitchcock surprises the actor by bringing him to the \"Psycho\" set and showing him a replica of the Gein house as it was found when the police arrested him. Along with the disheveled house having shrunken heads in the living room and a skull bowl in the sink, Hitchcock has Perkins open the freezer to find female genitalia. Perkins is in shock that Hitchcock would show him this, and the director tells him that he chose him for the role because, like Gein, he knows Perkins lives with a secret. (At the time of making \"Psycho,\" Perkins was a closeted gay man). Perkins then exits the house and vomits on the studio lot. \"There is no historical record of Hitchcock ever reconstructing Ed Gein's house or walking Anthony Perkins through it,\" Moral told Business Insider. \"This sequence in Ryan Murphy's series is best understood as dramatic license, not history.\" Although Hitchcock's \"Psycho\" is based on Bloch's book of the same name, and Bloch's mother-loving serial killer is loosely inspired by Gein, in reality, the filmmaker drew even less inspiration from Gein to create his classic horror movie. In \"The Ed Gein Story,\" Hitchcock is depicted as a man captivated by Bloch's tales of Gein's antics. But in truth, the director left most of the story structure to \"Psycho\" screenwriter Joseph Stefano. \"He left me pretty much on my own,\" Stefano is quoted as saying in \"The Dark Side of Genius: The Life of Alfred Hitchcock.\" Instead, Stefano leaned more into how the master of suspense made his movies than digging into Gein research. \"He wanted to talk about almost anything else but the job at hand,\" Stefano said of working with Hitchcock. \"And I felt that if it was going to be done the way he wanted, I'd have to see his films, so I asked to have a number of them screened for me.\" The fact that the \"Psycho\" production would have had enough budget to create a detailed replica of Ed Gein's house — despite the fact that the set would never appear in the movie — is unfounded. \"'Psycho' was made under a shoestring budget of $800,000 and filmed with Hitchcock's television crew,\" said Moral, referring to the crew Hitchcock already had for his TV series \"Alfred Hitchcock Presents.\" \"The Bates house and motel were built by his design team as fictional constructs, not replicas of the Gein farmhouse.\" Moral also points out how unlikely it is that Hitchcock would go to these kinds of lengths for one of his actors, given that the director once famously described actors as cattle. \"Hitchcock largely avoided discussing character motivations with his actors and deplored method acting,\" Moral said. \"It's also very unlikely that Hitchcock told Perkins that he cast him for his hidden homosexuality. Perkins was likely cast because he was known for playing boy-next-door types, and Hitchcock loved to subvert the audience's expectations and shock them with contrast, which is why he killed Janet Leigh, the major star, less than halfway through the movie.\" Netflix and a rep for Ryan Murphy did not respond to requests for comment. Though \"The Ed Gein Story\" depicts Perkins puking his guts out, in actuality, he was fond of working on \"Psycho\" and even starred in its three sequels. \"I enjoyed making 'Psycho,'\" Perkins said in \"The Dark Side of Genius.\" \"In fact, I accepted the film before I'd even read the script. [Hitchcock and I] got on very well, and he let me make several changes and suggestions. It was my idea that I should eat candy throughout the film. I thought it would be more interesting if the killer were a compulsive candy-eater.\" The Hitchcock/Perkins subplot concludes in episode three, with Perkins coming to terms with the fact t",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Netflix's \"Monster: The Ed Gein Story\" inaccurately portrays Alfred Hitchcock's development of \"Psycho,\" according to Hitchcock expert Tony Lee Moral. The series falsely depicts Hitchcock recreating Gein's house and using it to inspire actor Anthony Perkins, who played Norman Bates.",
      "word_count": 40
    },
    {
      "title": "Balsam Hill fans, rejoice: this Classic Spruce is 50% off for Prime Day",
      "description": "'Tis the season to shop on sale.",
      "url": "https://nypost.com/2025/10/07/shopping/balsam-hill-fans-rejoice-this-classic-spruce-is-50-off-for-prime-day/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/10/Balsam-Hill-Tree-Prime-Day.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2025-10-07T19:00:31Z",
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "Barret Wertz",
      "content": "New York Post may be compensated and/or receive an affiliate commission if you click or buy through our links. Featured pricing is subject to change.  Amazon Prime Day just gave my favorite faux tree… [+4587 chars]",
      "full_text": "Amazon Prime Day just gave my favorite faux tree a trim. The Balsam Hill 7.5-foot Classic Blue Spruce is 50% off, dropping to $399 from $799. I’ve reviewed Balsam Hill before, and the reason I keep coming back is simple: it looks like the tree you remember, only it doesn’t wilt, shed or test your holiday spirit (read: patience) on setup day. With all the best Prime Day deals our team is rounding up, the Classic Blue Spruce is the no-drama choice. Full shape. Natural color. Unlit, so you control the glow. It looks good in daylight and even better after dark. If I’m lucky, I get mine up the weekend after Thanksgiving (in between Black Friday sales, because you know, my job). Sections connect, branches fall into place, and suddenly the living room is ready, and I can get back to work. When January hits, it breaks down fast and slides into the included storage bag. If you’ve been waiting for a sign to upgrade, this is it. Balsam Hill at half price does not hang around long. Grab the deal, grab a great gift to put under it, like a TV on sale or one of the best Prime Day Apple deals we’ve found, and prepare for compliments from every guest who asks, “Wait, that’s artificial?” A full, classic profile with 2,960 branch tips for a dense, lifelike look, this Balsam Hill 7.5-ft Unlit Classic Blue Spruce Artificial Christmas Tree is the real deal. Its unlit design lets you customize your lights and keeps replacements simple, while the hinged branches and sectioned construction make assembly quick and takedown easy. It includes a premium metal stand and a storage bag for off-season protection. This annual Amazon sale — which we like to call October Prime Day — is similar to the well-known July event: it’s a two-day blow out shopping event with deep discounts on bestsellers and everyday essentials. But the timing of this sale makes all the difference; shoppers can also score pre-Black Friday deals on top-rated toys and sell-out-risk gifts before the holiday rush. Amazon’s fall Prime Day event only lasts two days. This sale starts on Tuesday October 7 at 12:01 a.m. PT and runs through Wednesday October 8 at 11:59 p.m. PT. Prime Big Deal Days 2025 ends on Wednesday October 8 at 11:59 p.m. PT, so east-coasters have until about 3 a.m. on October 9 their time to shop the deals. Prime Big Deal Days is a member-exclusive sale event. Interested shoppers can grab a 30-day free trial to try Prime, and its many benefits, with no strings attached. Already familiar with July Prime Day? Then you’ll love Amazon’s fall version! Like its summer spectacular sale, Amazon’s Prime Big Deal Days offers major discounts for 48 hours, but with a bigger focus on holiday gifts, toys and tech to shop ahead of Black Friday and Cyber Monday. From reporting on Amazon sales for years, we can tell you for certain that October Prime Day is the ideal period to stock up on household essentials, score great deals on gift-worthy items and toys, take advantage of Black Friday-level discounts on tech and appliances, refill your skincare empties, and comb through the massive catalog of Amazon best-sellers. We certainly think so! October Prime Day is a great chance to score Black Friday-worthy deals on thousands of best-sellers, including everything from big-ticket tech to Post reader-favorite trash bags. Our team diligently sorts through all the offers to find you the very best items to grab on sale. Already wondering when Amazon’s next Prime Day is? Prime Day takes place in July each year, so it’s safe to assume it will take place in mid-July 2026 — similar to previous years. Can’t wait to shop more Amazon deals? Look out for Amazon’s Black Friday sales to kick off the holiday season in November. Don’t miss Post Wanted’s around-the-clock coverage. Click here to find all of the best deals. For over 200 years, the New York Post has been America’s go-to source for bold news, engaging stories, in-depth reporting, and now, insightful shopping guidance. We’re not just thorough reporters – we sift through mountains of information, test and compare products, and consult experts on any topics we aren’t already schooled specialists in to deliver useful, realistic product recommendations based on our extensive and hands-on analysis. Here at The Post, we’re known for being brutally honest – we clearly label partnership content, and whether we receive anything from affiliate links, so you always know where we stand. We routinely update content to reflect current research and expert advice, provide context (and wit) and ensure our links work. Please note that deals can expire, and all prices are subject to change. Looking for a headline-worthy haul? Keep shopping Post Wanted.",
      "full_text_length": 4696,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Balsam Hill's popular 7.5-foot Classic Blue Spruce artificial Christmas tree is now available at half price during Amazon's Prime Day sale. The unlit tree, featuring nearly 3,000 branch tips for a realistic appearance, drops from $799 to $399. It includes a metal stand and storage bag.",
      "word_count": 46
    },
    {
      "title": "‘I Fear This Is Me’: Florida Man Says There’s ‘Nothing Better’ Than Having A Ryan Fitzpatrick In Your Boys Group. Here’s What He Means",
      "description": "Heading out for a night at the bar means assembling your squad. Whether you’re headed out on a night of debauchery or just want an evening with the boys, everyone has their own part to play. Maybe you’re the funny guy; maybe you’re the gregarious type that tu…",
      "url": "https://brobible.com/culture/article/ryan-fitzpatrick-boys-group/",
      "urlToImage": "https://brobible.com/wp-content/uploads/2025/10/theres-‘nothing-better-than-having-a-Ryan-Fitzpatrick-.jpg",
      "publishedAt": "2025-10-07T19:00:18Z",
      "source": {
        "id": null,
        "name": "BroBible"
      },
      "author": "Braden Bjella",
      "content": "Audio By Carbonatix  Heading out for a night at the bar means assembling your squad.  Whether youre headed out on a night of debauchery or just want an evening with the boys, everyone has their own p… [+3452 chars]",
      "full_text": "Via @nickysmokes TikTok/NFL TikTok Via @nickysmokes TikTok/NFL TikTok Audio By Carbonatix Heading out for a night at the bar means assembling your squad. Whether you’re headed out on a night of debauchery or just want an evening with the boys, everyone has their own part to play. Maybe you’re the funny guy; maybe you’re the gregarious type that turns a small hang into a group event. No matter who you are, you play an essential role in keeping the night going and the people happy. However, if you’re looking for someone to add to your crew, one user on TikTok recently sparked discussion with his recommendation: a “Ryan Fitzpatrick.” But what does that mean? In TikTok user Nicky’s video, which currently has over 57,000 views, he says that adding a “Ryan Fitzpatrick” to a friend group is essential. “There is nothing better than having a Ryan Fitzpatrick in your friend group,” Nicky (@nickysmokes) states. “You know, the guy that’s almost 40. He’s been in the league for 20 years. You would think he has a ring by now and he’s ready to retire, but he’s not. He’s just hopping from bar to bar like Ryan Fitzpatrick hopped from team to team.” The reasons for having such a character, Nicky says, are many. First, they have experience. Second, they take chances. Third, they do not fear rejection. Finally, as Nicky puts it, “He loves the game.” “There’s nowhere else he’d rather be than out there on the field with his men, ready to go to battle,” Nicky summarizes. Nicky closes by reiterating that every crew should at the very least consider adopting an “unc.” “If you do not have a Ryan Fitzpatrick in your friend group, you are missing out, brother, because that man is a leader,” he shares. “That man is the culture. That man will lead you through battle.” If you read the past few paragraphs wondering who Ryan Fitzpatrick is, well, you probably haven’t watched football for a while. That’s because Fitzpatrick was a solid player for a long, long time. How long? Try 17 seasons before announcing his retirement in 2022. During that time, he had some pretty major accomplishments. He played at least one game across nine different NFL teams. He was the first NFL quarterback to throw for over 400 yards in three consecutive games. He also has the most career passing yards and touchdowns of any NFL quarterback without a post-season appearance. That depends. On the field, Fitzpatrick was known for consistently giving it his all and rallying the team, even into his 17th season. He was also, given his experience, fairly older than his teammates. While the average age of an NFL player is just around 26, Fitzpatrick began his last season approaching his 39th birthday. So, are you comfortable having someone significantly older than you in the friend group? A decent amount of people are. Some studies have found that about four in 10 people have an intergenerational friendship. However, whether adding a “Ryan Fitzpatrick” leads to greater social success will depend on your Fitzpatrick—and your friend group. There’s nothing better than having a Ryan Fitzpatrick in your friend group #jokes #dating #football #nfl #unc ♬ original sound – Nickysmokess In the comments section, some users said they could envision themselves getting their own Ryan Fitzpatrick. Others realized that they were, in fact, their group’s Ryan Fitzpatrick. “Us unc got all the good stories. Can’t tell you how many crazy situations I got myself into lmao,” wrote a user. “I fear this is me. Plenty of playoff runs, no ring, currently on a 7 day bender,” offered another. “I’m the fitzmagic of my friends,” declared a third. “I fear most groups don’t have one,” noted a further TikToker. BroBible reached out to Nicky via TikTok and Instagram direct message.",
      "full_text_length": 3748,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "A viral TikTok video suggests every friend group needs a \"Ryan Fitzpatrick\" - an experienced, fearless member who's older but brings leadership and enthusiasm. The term references the NFL quarterback known for his 17-season career across nine teams and unwavering dedication to the game.",
      "word_count": 44
    },
    {
      "title": "Jordi Alba Becomes Second of Lionel Messi’s Barcelona Teammates to Announce Retirement",
      "description": "Jordi Alba has announced he will retire from professional soccer after Inter Miami's run in the MLS playoffs.",
      "url": "https://www.foxsports.com/stories/soccer/jordi-alba-announces-retirement-from-professional-soccer-at-end-of-inter-miamis-2025-playoff-run",
      "urlToImage": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2025/10/1408/814/alba1.jpg?ve=1&tl=1",
      "publishedAt": "2025-10-07T19:00:01Z",
      "source": {
        "id": "fox-sports",
        "name": "Fox Sports"
      },
      "author": "",
      "content": "Jordi Alba has announced that he will retire from professional soccer at the conclusion of Inter Miami's run in the Major League Soccer playoffs, making him the second of Lionel Messi's longtime team… [+1207 chars]",
      "full_text": "Jordi Alba has announced that he will retire from professional soccer at the conclusion of Inter Miami's run in the Major League Soccer playoffs, making him the second of Lionel Messi's longtime teammates to say this year will be his last. Alba revealed the news Tuesday, three days after Inter Miami held a retirement ceremony for Sergio Busquets. Alba was under contract with Inter Miami through 2027. \"The time has come to close a truly meaningful chapter in my life,\" Alba said on social media. \"I've decided to bring my professional football career to an end at the conclusion of this season. I do so with complete conviction, with peace and with happiness because I feel I've walked this path with every ounce of passion I had, and now it's just the right moment to open a new chapter and close the previous one with the best possible feeling.\" The 36-year-old Alba came to Inter Miami not long after Messi announced he was headed there in June 2023. Messi’s arrival led to Busquets, Luis Suarez and Alba — all teammates in Barcelona — joining MLS. Alba helped Barcelona win six La Liga titles, five Copa del Rey trophies and the Champions League in 2015. Reporting by The Associated Press. Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily!",
      "full_text_length": 1369,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Former Barcelona star Jordi Alba announced his retirement from professional soccer following Inter Miami's MLS playoff run. The 36-year-old defender, who joined Inter Miami in 2023 alongside Lionel Messi, ends his career after winning multiple titles with Barcelona, including six La Liga championships.",
      "word_count": 43
    },
    {
      "title": "‘Blame other drivers’: The bad driving habits Australians can’t stop admitting to",
      "description": "While most drivers are guilty of occasionally breaking road rules, Aussies are sharing the bad driving habits they can't shake.",
      "url": "https://www.drive.com.au/caradvice/blame-other-drivers-the-bad-driving-habits-australians-cant-stop-admitting-to/",
      "urlToImage": "https://media.drive.com.au/obj/tx_q:70,rs:auto:1920:1080:1/driveau/upload/cms/uploads/jpwjxfuhysmg82rjb3mk",
      "publishedAt": "2025-10-07T19:00:00Z",
      "source": {
        "id": null,
        "name": "Drive.com.au"
      },
      "author": "Ethan Cardinal",
      "content": "Concerningly, 38 per cent of respondents admitted they had been involved in an accident (or had a near miss) due to losing attention, with one in four drivers stating they were preoccupied by a smart… [+34 chars]",
      "full_text": "While most drivers are guilty of occasionally breaking local road rules, Aussies are sharing the bad driving habits they can't shake. Although most Australian drivers try their best to abide by the road rules, new data has revealed the most common bad driving habits that Aussies can't shake. In a recent survey conducted by AAMI Insurance, which polled more than 1000 local drivers, approximately nine in 10 Australian drivers admitted to driving while distracted. RELATED: ‘They’re the worst’: The Australian state with the worst drivers Concerningly, 38 per cent of respondents admitted they had been involved in an accident (or had a near miss) due to losing attention, with one in four drivers stating they were “preoccupied” by a smartphone or smart watch while driving. Additionally, 60 per cent – or two-thirds – of Australians confessed to being distracted by playing with their music or GPS, while a whopping 65 per cent admitted to eating or drinking a non-alcoholic drink behind the wheel – which is technically against the rules. The survey also found 40 per cent of motorists were preoccupied by other road users, including accidents and even pedestrians. Despite less than half of the respondents admitting to gawking at an accident, AAMI motor prevention manager Mary Kennedy said more than 60 per cent blamed other drivers for the same behaviour. “This shows we tend to be biased towards our own behaviours, believing we are safer drivers compared to others,” Kennedy said. “Australian drivers view their own behaviour behind the wheel through rose-tinted glasses.\" Despite knowing they're in the wrong, the report found almost a quarter of participants said they refused to change their bad behaviour unless they had a personal experience with road trauma. According to a report commissioned by the Australian Automobile Association – the national industry body – distracted driving accounts for approximately 16 per cent of serious road crashes. “Distracted driving is as serious a problem on Australian roads as drink driving. It impairs reaction time (including braking and swerving) and diminishes the ability to maintain speed and lane position,” the report concluded. However, it’s not just distracted driving that should be a cause for concern, as motorists also admitted to other dangerous driving habits. A survey of more than 1000 Australian motorists by Compare the Market found speeding was the second-most cited behaviour (24 per cent) behind eating and drinking while driving (27 per cent). Conversely, approximately 18 per cent of participants admitted to driving under the speed limit, while 13 per cent of respondents confessed to having road rage. A whopping 61 per cent of Australians surveyed said they were victims of road rage in the form of another driver’s use of angry gestures (27 per cent), tailgating (25.6 per cent), as well as yelling and shouting (20.3 per cent). Ethan Cardinal graduated with a Journalism degree in 2020 from La Trobe University and has been working in the fashion industry as a freelance writer prior to joining Drive in 2023. Ethan greatly enjoys investigating and reporting on the cross sections between automotive, lifestyle and culture. Ethan relishes the opportunity to explore how deep cars are intertwined within different industries and how they could affect both casual readers and car enthusiasts.",
      "full_text_length": 3375,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "A new AAMI Insurance survey reveals nine in ten Australian drivers admit to distracted driving, with 38% reporting accidents or near-misses due to inattention. Common distractions include smartphones, GPS use, and eating while driving, with 65% confessing to consuming food or non-alcoholic beverages behind the wheel.",
      "word_count": 46
    },
    {
      "title": "Darlington Nagbe to retire at end of 2025 season: A midfield legacy spanning three MLS giants",
      "description": "Darlington Nagbe, one of the most consistent and respected midfielders in MLS history, will retire after the 2025 season. From Portland to Atlanta to Columbus, his influence helped define three championship-caliber teams.",
      "url": "https://pitchside-us.com/darlington-nagbe-to-retire-at-end-of-2025-season-a-midfield-legacy-spanning-three-mls-giants/",
      "urlToImage": "https://pitchside-us.com/content/images/2025/10/DdfIao-VMAAVW4F.jpeg",
      "publishedAt": "2025-10-07T19:00:00Z",
      "source": {
        "id": null,
        "name": "Pitchside-us.com"
      },
      "author": "Felipe Fernandes da Silva",
      "content": "On Monday afternoon, veteran MLS reporter Tom Bogert confirmed what fans across the league have long suspected: Darlington Nagbe, the midfield maestro of Columbus Crew and one of Major League Soccers… [+3350 chars]",
      "full_text": "On Monday afternoon, veteran MLS reporter Tom Bogert confirmed what fans across the league have long suspected: Darlington Nagbe, the midfield maestro of Columbus Crew and one of Major League Soccer’s most influential players, will retire at the conclusion of the 2025 season. A Letter From The Captain ✍️Darlington Nagbe has announced he will retire at the end of the 2025 season. pic.twitter.com/GOHNeyzOS0 At 35, Nagbe’s career reads like a masterclass in consistency and positional intelligence. Drafted second overall in the 2011 MLS SuperDraft out of the University of Akron, he became the first-ever player selected by the Portland Timbers in their modern MLS era. Over seven seasons and more than 200 appearances, Nagbe steadily transformed from a promising rookie into a club legend. Role Model. Leader. LE6END 💎 pic.twitter.com/UXSfJ976vR His crowning achievement in Portland came in 2015, when he helped lead the club to its first MLS Cup title—a triumph that solidified his place among the league’s elite. Nagbe’s ability to retain possession under pressure and control the game’s tempo gave Portland a tactical edge few midfielders could replicate. BREAKING: Columbus Crew midfielder and MLS legend Darlington Nagbe is retiring after the 2025 MLS season, per sources.Nagbe, 35, is a four-time MLS Cup winner (2015, 2018, 2020, 2023) with three clubs (Portland, Atlanta, Columbus).One of MLS's best-ever midfielders 👏 pic.twitter.com/g6DE8ZAYhq In 2018, Nagbe joined an ambitious Atlanta United side and seamlessly integrated into one of the most electrifying squads in league history. Across three seasons and 74 appearances, he linked up with stars like Miguel Almirón and Josef Martínez to capture the 2018 MLS Cup—ironically defeating his former team, Portland, in the final. Nagbe’s contribution went beyond stats. His composure, crisp distribution, and ability to dictate rhythm embodied the classical midfielder archetype. The following year, he added a U.S. Open Cup title to his growing trophy collection, further solidifying his status as one of the league’s most quietly dominant players. At 30, Nagbe returned to his home state to join Columbus Crew—ushering in what would become perhaps the most defining chapter of his career. Over five seasons and 212 matches, he became the club’s beating heart, helping deliver MLS Cup titles in 2020 and 2023, and the 2024 Leagues Cup. But it wasn’t just about silverware. Nagbe became a locker room leader, a mentor to younger teammates, and the cultural backbone of the Crew. His presence was felt not only in midfield but across the club—on the field, in training sessions, and throughout the Columbus community. A Midfield Titan Across Three Clubs Nagbe may not top the charts for goals or flashiest highlights, but few players have ever matched his consistency, influence, and tactical intelligence. To have anchored three separate MLS clubs—each of them lifting major trophies during his tenure—is a rare feat. As the 2025 season winds down, Darlington Nagbe walks toward retirement not just as a champion, but as a standard-bearer of what elite midfield play can look like in MLS. His legacy, built on calm in chaos and unshakable control, will endure long after his final match.",
      "full_text_length": 3249,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Four-time MLS Cup winner Darlington Nagbe announced his retirement, effective after the 2025 season. The 35-year-old midfielder's illustrious career spans three clubs - Portland Timbers, Atlanta United, and Columbus Crew - where he consistently demonstrated exceptional skill and leadership, winning multiple championships.",
      "word_count": 42
    },
    {
      "title": "Amazon removes guns from classic James Bond movie posters: “You’re about to alienate your core fanbase”",
      "description": "Amazon made a bizarre move by editing guns out of the James Bond posters, which has left fans perplexed.    Earlier this year, Amazon MGM Studios paid $1 billion to get creative control over the James Bond franchise. Ever since Dr. No was released in 1962, th…",
      "url": "https://www.dailydot.com/entertainment/amazon-removes-guns-from-james-bond-posters/",
      "urlToImage": "https://uploads.dailydot.com/2025/10/amazon-removes-guns-from-james-bond-posters.png?auto=compress&fit=scale&fm=png&w=2000&h=1000",
      "publishedAt": "2025-10-07T19:00:00Z",
      "source": {
        "id": null,
        "name": "The Daily Dot"
      },
      "author": "Jamie Jirak",
      "content": "Amazon made a bizarre move by editing guns out of the James Bond posters, which has left fans perplexed.   Earlier this year, Amazon MGM Studios paid $1 billion to get creative control over the James… [+3877 chars]",
      "full_text": "Amazon made a bizarre move by editing guns out of the James Bond posters, which has left fans perplexed. Earlier this year, Amazon MGM Studios paid $1 billion to get creative control over the James Bond franchise. Ever since Dr. No was released in 1962, the Broccoli family has led the 007 films. Now, there’s a big question mark surrounding one of the longest-running franchises. After Daniel Craig’s final outing, No Time To Die, was released in 2021, fans have been eager to find out what’s next for the franchise. Who will play the character? Will the tone shift back to the earlier film’s more exaggerated fun style, or stick with the darker themes from the Craig era? Ever since Amazon took control in February, fans have been concerned about Bond’s future. With these new altered posters, their apprehension is only growing. As you can see in the post below, Bond posters that once included guns now show the former Bonds in awkward positions. While Amazon has not explicitly said why this choice was made, it’s likely due to the current political climate. “Just being disarming, darling”https://t.co/41P6Tkg2PK pic.twitter.com/KQQYif7d0q Gun control is one of the biggest hot-button issues out there. Mass shootings have become commonplace in the United States, while the people in charge refuse to take gun reform seriously. The topic has only become more heated in recent weeks due to the assassination of Charlie Kirk. The right-wing podcaster was previously quoted as saying gun deaths were “worth it” to protect the Second Amendment. The fact that he was killed by a gun has only fueled the debate, leaving both sides of the aisle more passionate about their stance than ever. Likely, Amazon didn’t want one of its biggest franchises to be instantly associated with guns. The problem? James Bond is a spy, and having a gun is a huge part of his identity. Bonds fans are confused about Amazon’s choice to remove guns from the posters. People were already skeptical about the sale, and this decision isn’t helping. “I still can’t believe that Amazon thought it was a good idea to photoshop the James Bond posters to erase the gun from them. The absurdity of the reasoning leaves me speechless,” one fan wrote. Je n’en reviens toujours pas qu’Amazon se soit dit que c’était une bonne idée de photoshoper les affiches des James Bond afin d’y effacer le flingue. L’absurdité de la réflexion me laisse sans voix. pic.twitter.com/XQUuTWKZHl “Hey @AmazonMGMStudio, WTF is wrong with you? Get your [expetive] together and fast. You’re about to alienate your core fanbase and destroy the franchise you paid billions for. Bond is an ASSASSIN. He is NOT a GQ model. This is what creative control looks like? Are you total idiots?” another fan wrote. Hey @AmazonMGMStudio , WTF is wrong with you? Get your sh*t together and fast. You’re about to alienate your core fanbase and destroy the franchise you paid billions for. Bond is an ASSASSIN. He is NOT a GQ model. This is what creative control looks like? Are you total idiots? pic.twitter.com/VBjWzctQXo “Notice in these Amazon #JamesBond digital posters they’ve removed all the guns and given awkward poses? Welcome to a world where promoting James Bond 007 needs to be done without his sidearm,” one person observed. Notice in these Amazon #JamesBond digital posters they’ve removed all the guns and given awkward poses?Welcome to a world where promoting James Bond 007 needs to be done without his sidearm. pic.twitter.com/3NGkxXShcn While no one from Amazon has made any specific statements about the Bond posters, they have since quietly removed the edited versions. It’s clear the backlash was loud enough that they realized their mistake. However, the damage is done when it comes to shaking up people’s faith in their ability to lead the longstanding franchise. The biggest test for Amazon will ultimately be the Bond casting. There have been rumors swirling over the last couple of years with names ranging from Tom Holland and Aaron Taylor-Johnson to Richard Madden and Henry Cavill. Whoever the next 007 is, Amazon has some big shoes to fill from the Broccoli family. The internet is chaotic—but we’ll break it down for you in one daily email. Sign up for the Daily Dot’s newsletter here.",
      "full_text_length": 4251,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Amazon MGM Studios has sparked controversy by digitally removing guns from classic James Bond movie posters following their $1 billion acquisition of the franchise. The move has angered fans who argue that firearms are integral to the spy character's identity. Amazon hasn't commented on the alterations.",
      "word_count": 46
    },
    {
      "title": "Windows 10 End of Life - what does it mean for PC gamers?",
      "description": "If you’re unsure if you’ll still be able to play your favorite games when Microsoft kills Windows 10 support, we’ve got all the answers.",
      "url": "https://www.techradar.com/computing/windows/windows-10-end-of-life-what-does-it-mean-for-pc-gamers",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/MJcAbNuYtTjkH2van9Np3a-2560-80.jpg",
      "publishedAt": "2025-10-07T19:00:00Z",
      "source": {
        "id": "techradar",
        "name": "TechRadar"
      },
      "author": "Jasmine Mannan",
      "content": "The clock is ticking for Windows 10. For the past decade, it's been the operating system of choice for millions of PC gamers, offering a (relatively) stable and reliable platform for countless virtua… [+6320 chars]",
      "full_text": "The clock is ticking for Windows 10. For the past decade, it's been the operating system of choice for millions of PC gamers, offering a (relatively) stable and reliable platform for countless virtual adventures. But as of October 14, 2025, Microsoft is officially ending support for Windows 10. This means if you're still clinging on to the old OS, it's time to seriously consider making the jump to Windows 11. Ignoring the upgrade could leave you vulnerable to security risks and, more importantly for gamers, potentially out in the cold when it comes to your favorite titles. Before continuing, it’s worth noting that you don’t have to upgrade to Windows 11 right away - you can continue using a Windows 10 device, it’ll just be unsupported. However, using Windows 10 after October 14, 2025, poses significant risks for PC gamers. Without updates, security vulnerabilities will increase, threatening personal data. Game compatibility and performance will decline as developers cease optimization, leading to lower frame rates, crashes, and eventually, the inability to run new games, effectively rendering the system obsolete. For many PC gamers, the news of Windows 10 reaching its end of life casts a long shadow over the cherished and often extensive digital game libraries they've cultivated over the years. A paramount concern revolves around compatibility: will the vast collection of titles on platforms like Steam still function as expected? What about popular, ongoing live-service games such as Roblox, which demand consistent updates and online connectivity? Initially, there's good news: many existing platforms and individual games are likely to continue running, at least for a transitional period, on an unsupported Windows 10 operating system. However, this is unsustainable in the long term. Sign up for breaking news, reviews, opinion, top tech deals, and more. The cessation of official support from Microsoft for Windows 10 initiates a gradual but inevitable decline in its viability as a gaming platform. Without the security patches, bug fixes, and underlying system optimizations that come with active support, the operating system becomes increasingly vulnerable and less efficient. More critically for gamers, this lack of official backing means that software developers, including those responsible for game engines, development tools, and, crucially, the games themselves, will eventually cease to guarantee compatibility with Windows 10. While gaming giants like Valve (the company behind Steam) haven't issued an explicit statement regarding an end to Windows 10 support, the industry trend is clear. Major platforms will inevitably align their development roadmaps with actively supported operating systems. This means that future updates to the Steam client, or other launchers like Epic Games Store, might introduce features or technical requirements that are not fully compatible with an outdated Windows 10 device. Gamers could find themselves unable to access new platform features, or even facing issues with the client itself. Game developers, from independent studios to large AAA publishers, operate on finite resources. Their development and optimization efforts will naturally prioritize Windows 11, which offers the latest security features, and performance enhancements. If you continue to game on Windows 10, you may face the following issues: In essence, while the transition may not be immediate or sudden, the end of life for Windows 10 marks the beginning of a slow but undeniable process where PC gamers remaining on the unsupported OS will likely be left behind. Their gaming experience will degrade, characterized by declining performance, unaddressed issues, and an eventual inability to participate in the latest and greatest offerings the gaming world has to offer. The incentive to upgrade to a supported operating system, primarily Windows 11, will become increasingly compelling as these challenges mount. Upgrading to Windows 11 is not just about staying current; it's about future-proofing your gaming experience. Don't get caught out when your favorite games stop playing nice with your old OS. Make the switch sooner rather than later for the best safety and security. Below, you'll find some of our recommendations for gaming laptops depending on your budget. Make sure you check out our best gaming laptops and best budget gaming laptop guides as well for more expert buying advice. Jasmine is a gaming hardware and tech journalist with an appreciation for all things others dare to call boring or complicated. Previously of GamesRadar and The Mirror, Jasmine has reviewed and covered hundreds of devices from laptops to sound bars, monitors to cameras and almost everything in-between. In her spare time, Jasmine enjoys playing games that make her rage and building PCs, which also makes her rage – as well as spending time with her three cats. Crazy cat lady in the making! You must confirm your public display name before commenti",
      "full_text_length": 5000,
      "importance": 5,
      "world_relevance": 5,
      "interestingness": 5,
      "overall_score": 5.0,
      "emoji": "📰",
      "category": "World News",
      "rewritten_text": "Microsoft will end Windows 10 support on October 14, 2025, prompting PC gamers to consider upgrading to Windows 11. While existing games may continue working initially, the lack of security updates and declining developer support will eventually impact game compatibility and performance, potentially limiting access to new titles.",
      "word_count": 48
    }
  ]
}